{
  "version": 1,
  "lastSyncedAt": "2026-02-14T09:03:40.459Z",
  "project": {
    "name": "Arij",
    "description": "A local, AI-first project orchestrator that provides a web interface for managing multi-project workflows with Claude Code as the execution engine. It covers the full project lifecycle: ideation, specification, kanban-based planning, automated code generation via Claude Code CLI, real-time agent monitoring, and release management.",
    "status": "specifying",
    "spec": "The plan is ready for your review. It covers 5 phases:\n\n1. **Schema** — 4 new nullable columns across `agentSessions` and `chatConversations`\n2. **Provider Layer** — Capture CLI session IDs from output, inject `--resume` flag for Claude Code and Gemini CLI\n3. **Process Manager** — Persist `cliSessionId` to DB on session completion\n4. **Chat Continuity** — Resume-first logic with automatic fallback to fresh prompt if the session expired\n5. **Work Session Resume** — New API endpoint, session picker dialog, and integration into build/review hooks\n\nKey design decisions:\n- Codex is marked non-resumable (its `exec` mode doesn't support `--resume`)\n- `resolveAgent()` is extended to return `namedAgentId` for session filtering\n- Resume failures fall back gracefully to full-prompt mode"
  },
  "epics": [
    {
      "id": "4587o18AAsJ7",
      "title": "Mistral Vibe CLI Provider Parity",
      "description": "Implement Mistral Vibe as a first-class provider across the same perimeter as existing CLI agents (build, review, chat, brainstorm, and release) using the current named-agent and assignment architecture.\n\nImplementation plan:\n1. Foundation: add `mistral-vibe` to provider enums/types/validation and provider registry wiring.\n2. Runner: add a Vibe execution module following the Codex/Gemini pattern, using headless invocation with `--prompt`, `--model`, `--agent`, and JSON output for machine parsing.\n3. Configuration: support both a global default Vibe profile and per-named-agent profile override (`plan`, `accept-edits`, `auto-approve`) while keeping existing model selection behavior.\n4. Dispatch integration: route all existing agent execution flows through provider/model/profile resolution and provider-agnostic process dispatch.\n5. UI parity: expose Mistral Vibe in existing provider selectors and add profile selection to current settings/agents/assignments surfaces with default-vs-override behavior.\n6. Quality: add tests for command construction, profile precedence, and flow dispatch parity; update docs.\n\nOut of scope: advanced Vibe-only controls (`--max-turns`, `--max-price`, `--resume`) and streaming-specific UX.",
      "priority": 0,
      "status": "backlog",
      "position": 0,
      "branchName": null,
      "user_stories": [
        {
          "id": "Gj7JJSif4i1p",
          "title": "As a platform engineer, I want `mistral-vibe` added as a provider type so that projects can configure Vibe like other CLI agents",
          "description": "Extend shared provider definitions, API validation, and persistence mappings to recognize `mistral-vibe` end-to-end without changing current behavior for existing providers.",
          "acceptance_criteria": "- [ ] `mistral-vibe` is accepted by provider enums/types on backend and frontend.\n- [ ] API payload validation and serialization support `mistral-vibe`.\n- [ ] Provider registry/process dispatch can resolve `mistral-vibe` at runtime.\n- [ ] Existing provider configurations continue to work unchanged after migration.",
          "status": "todo",
          "position": 0
        },
        {
          "id": "JbfwNkLZC98u",
          "title": "As an orchestration service, I want a Mistral Vibe runner so that agent tasks execute headlessly and deterministically",
          "description": "Create Vibe spawn/provider modules that build and execute CLI commands in non-interactive mode, parse structured output, and normalize error handling to match existing provider contracts.",
          "acceptance_criteria": "- [ ] A Vibe runner module is implemented following the existing provider pattern.\n- [ ] Command generation includes prompt, model, profile (`--agent`), and JSON output mode.\n- [ ] Final response text and usage/error metadata are parsed into the common provider result shape.\n- [ ] Timeouts, non-zero exits, and malformed output are mapped to normalized platform errors.",
          "status": "todo",
          "position": 1
        },
        {
          "id": "wSD3sWE6_sQs",
          "title": "As a project admin, I want both global default and per-named-agent Vibe profiles so that autonomy can be controlled safely",
          "description": "Add configuration support for a project/provider-level default Vibe profile and optional named-agent override, with deterministic precedence during agent resolution.",
          "acceptance_criteria": "- [ ] Global default Vibe profile is configurable and persisted.\n- [ ] Named agents can optionally override profile with `plan`, `accept-edits`, or `auto-approve`.\n- [ ] Resolution precedence is enforced: named-agent override > global provider default > system fallback.\n- [ ] Invalid profile values are rejected by validation.",
          "status": "todo",
          "position": 2
        },
        {
          "id": "Deolo70l9G5I",
          "title": "As a product user, I want all existing agent flows to dispatch through Mistral Vibe when selected so that behavior matches other providers",
          "description": "Wire build, review, chat, brainstorm, and release execution paths to resolve provider/model/profile and pass them to provider-agnostic dispatch.",
          "acceptance_criteria": "- [ ] Build flow executes with Mistral Vibe when provider is selected.\n- [ ] Review flow executes with Mistral Vibe when provider is selected.\n- [ ] Chat, brainstorm, and release flows execute with Mistral Vibe when provider is selected.\n- [ ] Each flow passes resolved model/profile and records provider/model in execution metadata.",
          "status": "todo",
          "position": 3
        },
        {
          "id": "bc-y34qtoEi-",
          "title": "As a project admin, I want UI parity for Mistral Vibe in provider, model, and profile selectors so that configuration is consistent",
          "description": "Update existing UI surfaces (settings, agents, assignments) to include `mistral-vibe` and profile selection without adding new standalone configuration concepts.",
          "acceptance_criteria": "- [ ] Provider dropdowns include `mistral-vibe` wherever other CLI providers are selectable.\n- [ ] Model selection for `mistral-vibe` is available with the same UX pattern used by existing providers.\n- [ ] Profile selection supports default-vs-override behavior in existing forms.\n- [ ] No new Vibe-specific advanced controls are exposed in this epic.",
          "status": "todo",
          "position": 4
        },
        {
          "id": "3tW49gimqm4k",
          "title": "As a maintainer, I want automated coverage for Vibe parity so that regressions are caught before release",
          "description": "Add targeted tests and documentation updates validating command assembly, profile precedence, and dispatch behavior across supported flows.",
          "acceptance_criteria": "- [ ] Unit tests cover Vibe command construction and output parsing.\n- [ ] Unit tests cover profile precedence resolution.\n- [ ] Integration/smoke tests verify dispatch success for build/review and coverage for chat/brainstorm/release routing.\n- [ ] Developer docs include setup, required CLI assumptions, and known out-of-scope constraints.",
          "status": "todo",
          "position": 5
        }
      ]
    },
    {
      "id": "7FFiclGUqPE-",
      "title": "GitHub Release Lifecycle",
      "description": "Extend release creation flow to support tag push and GitHub draft release creation, then allow publishing drafts directly from Arij. Keep explicit user control with draft-first strategy.",
      "priority": 2,
      "status": "done",
      "position": 0,
      "branchName": null,
      "user_stories": [
        {
          "id": "K6_IUHc-yGnX",
          "title": "As a release manager, I want an option to push release tags to GitHub so that releases can be prepared remotely at creation time",
          "description": "Enhance release creation endpoint to accept push-to-GitHub flag and execute tag push plus draft release creation when enabled.",
          "acceptance_criteria": "- [ ] Release create API accepts `pushToGitHub` boolean input\\n- [ ] When enabled, API pushes the tag before creating GitHub draft release\\n- [ ] Release record stores `githubReleaseId`, `githubReleaseUrl`, and `pushedAt`\\n- [ ] If GitHub push fails, local release creation behavior is deterministic and error is explicit",
          "status": "todo",
          "position": 0
        },
        {
          "id": "ZYmhbo0QGHZF",
          "title": "As a release manager, I want to publish a draft GitHub release from Arij so that I can finalize releases without leaving the app",
          "description": "Add publish endpoint and UI action to publish previously created draft GitHub releases.",
          "acceptance_criteria": "- [ ] Publish endpoint exists for release id and validates GitHub configuration\\n- [ ] Publish action updates local release metadata after remote success\\n- [ ] UI disables publish while request is in progress to prevent duplicate submits\\n- [ ] Publish failures are surfaced with actionable messages",
          "status": "todo",
          "position": 1
        },
        {
          "id": "_4nrauNQA62P",
          "title": "As a product lead, I want release cards to display GitHub state so that release readiness is visible at a glance",
          "description": "Update releases page with draft badge, publish button, and external GitHub link visibility rules.",
          "acceptance_criteria": "- [ ] Draft releases show explicit draft badge\\n- [ ] Publish button appears only for draft releases with valid GitHub mapping\\n- [ ] View on GitHub link appears when `githubReleaseUrl` exists\\n- [ ] Push-to-GitHub checkbox appears only when project GitHub config is complete",
          "status": "todo",
          "position": 2
        },
        {
          "id": "f-cAL6j1bTgd",
          "title": "As an operator, I want release operations logged in sync logs so that release incidents can be traced",
          "description": "Record push tag, release create, and release publish operations in `gitSyncLog` with success or failure details.",
          "acceptance_criteria": "- [ ] Tag push, release create, and release publish write `gitSyncLog` records\\n- [ ] Log entries include operation type, project id, status, and detail payload\\n- [ ] Failures include remote error identifiers when available\\n- [ ] Logs can be queried by release workflow for debugging",
          "status": "todo",
          "position": 3
        }
      ]
    },
    {
      "id": "agJ6EuLOQFEs",
      "title": "Dependency-Aware Batch Ticket Orchestration",
      "description": "Build an orchestration epic for Arij that adds ticket dependencies and batch actions while reusing existing PR/Git/review flows. Scope is limited to dependencies inside one project (including tickets across different epics in that project), with schema designed for future cross-project expansion.\n\nImplementation plan:\n1. Dependency domain model\n- Add dependency edges (`ticket_id`, `depends_on_ticket_id`, `project_id`) plus extensibility fields (`scope_type`, `scope_id`) for future scope expansion.\n- Enforce current business rule: dependencies are valid only within the same project.\n- Persist dependency metadata generated by the ticket-creation agent.\n2. Ticket detail dependency management\n- Add dependency editor in ticket detail to add/remove predecessors.\n- Validate DAG integrity on every update (cycle detection with explicit error path).\n3. Batch selection UX\n- On ticket selection, auto-include all transitive prerequisites.\n- Mark auto-included tickets as required and non-deselectable while dependents remain selected.\n- Show batch actions `Review all` and `Merge all` when multiple tickets are selected.\n4. DAG scheduler and execution engine\n- Implement topological planning for batch `build`, `review`, and `merge` actions.\n- Run dependent chains sequentially and independent branches in parallel, while respecting existing agent concurrency guardrails.\n- Track per-ticket states: `ready`, `running`, `blocked`, `failed`, `success`.\n5. Failure policy and remediation\n- If a ticket fails, block descendants and continue all independent branches.\n- For `Merge all`, add a batch toggle to auto-launch a merge agent on first failure for every failed ticket (including auto-included tickets), with no retry limit; rely on existing manual agent stop controls.\n6. Integration and quality\n- Reuse existing single-ticket PR/Git/review/build pathways; do not duplicate core Git/PR logic.\n- Add tests for transitive auto-inclusion, DAG validation, topological execution, failure propagation, and auto-merge triggering.",
      "priority": 0,
      "status": "done",
      "position": 1,
      "branchName": "feature/epic-agJ6EuLOQFEs-dependency-aware-batch-ticket-orchestrat",
      "user_stories": [
        {
          "id": "DynImT-ih_Dn",
          "title": "As a project manager, I want dependencies generated during ticket creation so that the initial execution order is correct by default",
          "description": "When the ticket-generation agent creates multiple tickets, it must also create dependency edges that reflect intended implementation order. Dependencies can link tickets across epics, but only inside the same project.",
          "acceptance_criteria": "- [ ] Ticket creation payload supports dependency edges produced by the generation agent\n- [ ] Dependencies are persisted with project-bound validation (same-project only)\n- [ ] Cross-epic dependencies inside the same project are accepted\n- [ ] Cross-project dependencies are rejected with a clear validation error",
          "status": "in_progress",
          "position": 0
        },
        {
          "id": "MoSuSTd1-2AZ",
          "title": "As a developer, I want to edit dependencies in ticket detail so that I can correct or refine execution order manually",
          "description": "Ticket detail includes a dependency editor for adding/removing predecessor tickets. Every change is validated as a DAG to prevent invalid plans.",
          "acceptance_criteria": "- [ ] Ticket detail view allows adding and removing predecessor tickets\n- [ ] Only tickets from the same project are selectable as dependencies\n- [ ] Save is blocked when the update introduces a cycle\n- [ ] Cycle error includes enough context to identify the problematic chain",
          "status": "in_progress",
          "position": 1
        },
        {
          "id": "LSacQUOe1rIq",
          "title": "As a product operator, I want automatic transitive prerequisite selection so that batch actions always include required tickets",
          "description": "When users select tickets for a batch operation, all transitive dependencies are auto-included and locked to prevent invalid partial batches.",
          "acceptance_criteria": "- [ ] Selecting a ticket auto-includes all transitive prerequisites\n- [ ] Auto-included tickets are visually identified as required\n- [ ] Required auto-included tickets cannot be manually deselected while needed\n- [ ] `Review all` and `Merge all` buttons appear when multiple tickets are selected",
          "status": "in_progress",
          "position": 2
        },
        {
          "id": "JS1R14Wi35nx",
          "title": "As a release engineer, I want DAG-based batch scheduling so that dependent work runs in order while independent work runs faster in parallel",
          "description": "Batch execution for `build`, `review`, and `merge` uses topological scheduling: sequential execution along dependency chains and parallel execution for independent branches, subject to existing concurrency controls.",
          "acceptance_criteria": "- [ ] Batch scheduler computes a valid topological plan before execution\n- [ ] Tickets with unresolved predecessors do not start\n- [ ] Independent ready tickets can execute in parallel\n- [ ] Per-ticket state transitions are tracked as `ready`, `running`, `blocked`, `failed`, `success",
          "status": "in_progress",
          "position": 3
        },
        {
          "id": "ClpZdzg8Vd30",
          "title": "As an operator, I want failure propagation rules that block only dependent tickets so that unrelated work continues",
          "description": "If one ticket fails in a batch, only its descendants are blocked. The rest of the graph continues to execute when independent.",
          "acceptance_criteria": "- [ ] Failed ticket causes all descendants to transition to `blocked`\n- [ ] Independent tickets remain eligible and continue execution\n- [ ] Blocked tickets store and display the failed ancestor reason\n- [ ] Batch summary clearly separates `failed` vs `blocked` outcomes",
          "status": "in_progress",
          "position": 4
        },
        {
          "id": "cEozY74FNsWX",
          "title": "As a release manager, I want an auto-merge-agent option in `Merge all` so that failed merges can be retried autonomously",
          "description": "In `Merge all`, users can enable a batch-level toggle that triggers an agent immediately on first merge failure for each failed ticket, including auto-included tickets.",
          "acceptance_criteria": "- [ ] `Merge all` includes a batch toggle for auto-merge agent behavior\n- [ ] On first merge failure, an agent is launched automatically for that failed ticket\n- [ ] Behavior applies to all tickets in the batch, including auto-included prerequisites\n- [ ] No retry cap is enforced by this epic; operators can stop agents manually using existing app controls",
          "status": "in_progress",
          "position": 5
        }
      ]
    },
    {
      "id": "L603hggiADs2",
      "title": "Can't create named agent",
      "description": "## Error Type\nRuntime TypeError\n\n## Error Message\ncreateAgent is not a function\n\n\n    at handleCreate (components/agent-config/NamedAgentsTab.tsx:129:22)\n\n## Code Frame\n  127 |     if (!name.trim() || !model.trim()) return;\n  128 |     setCreating(true);\n> 129 |     const ok = await createAgent({\n      |                      ^\n  130 |       name: name.trim(),\n  131 |       provider,\n  132 |       model: model.trim(),\n\nNext.js version: 16.1.6 (Turbopack)",
      "priority": 2,
      "status": "done",
      "position": 2,
      "branchName": null,
      "user_stories": []
    },
    {
      "id": "5iylxlQ0pR2v",
      "title": "TIckets are sometimes sent to \"Done\" even if no review has been done and the branch / worktree isn't merge. Once dev done, the ticket should be sent in review",
      "description": null,
      "priority": 2,
      "status": "done",
      "position": 3,
      "branchName": null,
      "user_stories": []
    },
    {
      "id": "nYiJCMMioN7a",
      "title": "Named Agents with Model Selection & Gemini CLI Provider",
      "description": "Extend the agent system from simple CLI provider selection to named agents that combine a CLI provider with a specific model. Users can create named agents like 'CC Opus 4.6' (Claude Code + claude-opus-4-6), 'Codex GPT-5.3' (Codex + gpt-5.3), or 'Gemini Flash' (Gemini CLI + gemini-2.0-flash), then assign one named agent per task type (build, review, chat, etc.). This also adds full Gemini CLI support as a third provider alongside Claude Code and Codex.\n\n## Implementation Plan\n\n### Phase 1: Schema & Types\n- Add `namedAgents` table to Drizzle schema with columns: id, name, provider (claude-code | codex | gemini-cli), model (text), createdAt\n- Add `namedAgentId` foreign key column to `agentProviderDefaults` table\n- Extend all provider type unions to include `gemini-cli`\n\n### Phase 2: Gemini CLI Provider\n- Create `lib/gemini/spawn.ts` implementing the spawn interface using `gemini --prompt` with `--model`, `--yolo`, and `--output-format stream-json` flags\n- Create `lib/providers/gemini-cli.ts` provider adapter returning `SpawnedClaude`-compatible interface\n- Register Gemini CLI in the provider factory alongside claude-code and codex\n- Generalize process manager dispatch to handle all three providers\n\n### Phase 3: Named Agent CRUD & Resolution\n- Create `lib/agent-config/named-agents.ts` with list, create, update, delete operations\n- Implement `resolveAgent(taskType, projectId)` function that looks up the named agent for a task type and returns { provider, model }\n- Backward compatibility: when `namedAgentId` is null, fall back to existing `provider` column behavior\n\n### Phase 4: API Routes\n- Add CRUD API routes for named agents at `/api/agent-config/named-agents`\n- Update provider defaults API to accept `namedAgentId`\n- Update build, review, and chat dispatch routes to use `resolveAgent()` instead of direct provider lookup\n\n### Phase 5: UI\n- Add new 'Agents' tab in agent settings for creating/editing/deleting named agents (name + provider dropdown + model text input)\n- Update 'Providers' tab to show a named agent dropdown per task type instead of raw provider select\n- Show agent name in session monitoring and activity indicators",
      "priority": 0,
      "status": "done",
      "position": 4,
      "branchName": "feature/epic-nYiJCMMioN7a-named-agents-with-model-selection-gemini",
      "user_stories": [
        {
          "id": "rriVC9h9tsTA",
          "title": "As a user, I want a named_agents database table so that agent configurations are persisted",
          "description": "Create the Drizzle schema for the `namedAgents` table with id (nanoid), name (text, unique), provider (text enum: claude-code | codex | gemini-cli), model (text), and createdAt. Add a nullable `namedAgentId` foreign key column to the existing `agentProviderDefaults` table. Extend all TypeScript type unions for providers to include 'gemini-cli'. Generate and push the migration.",
          "acceptance_criteria": "- [ ] `namedAgents` table exists in schema with id, name, provider, model, createdAt columns\n- [ ] Provider column is constrained to 'claude-code', 'codex', 'gemini-cli'\n- [ ] `agentProviderDefaults` table has nullable `namedAgentId` FK referencing `namedAgents.id`\n- [ ] All provider type unions across the codebase include 'gemini-cli'\n- [ ] Migration generates and pushes cleanly\n- [ ] Existing data is unaffected (backward compatible)",
          "status": "in_progress",
          "position": 0
        },
        {
          "id": "6W24diqAuMde",
          "title": "As a user, I want Gemini CLI as a supported provider so that I can use Google's models for tasks",
          "description": "Implement the Gemini CLI spawn logic in `lib/gemini/spawn.ts` that executes `gemini --prompt <prompt> --model <model> --yolo --output-format stream-json --include-directories <cwd>`. Parse the streaming JSONL output into the same event format used by Claude Code and Codex. Create `lib/providers/gemini-cli.ts` adapter that returns a SpawnedClaude-compatible interface (stdout stream, process handle, kill method). Register Gemini CLI in the provider factory. Handle error cases (CLI not installed, auth failures, model not available).",
          "acceptance_criteria": "- [ ] `lib/gemini/spawn.ts` spawns `gemini` CLI with correct flags (--prompt, --model, --yolo, --output-format stream-json)\n- [ ] Streaming JSONL output is parsed and normalized to match existing event format\n- [ ] `lib/providers/gemini-cli.ts` returns SpawnedClaude-compatible interface\n- [ ] Provider factory recognizes 'gemini-cli' and dispatches to correct spawn function\n- [ ] Process manager can track and kill Gemini CLI processes\n- [ ] Error handling covers: CLI not found, authentication errors, invalid model name",
          "status": "in_progress",
          "position": 1
        },
        {
          "id": "xZLdhRvRMF4i",
          "title": "As a user, I want CRUD operations for named agents so that I can create and manage agent configurations",
          "description": "Create `lib/agent-config/named-agents.ts` with functions: listNamedAgents(), createNamedAgent({ name, provider, model }), updateNamedAgent(id, { name?, provider?, model? }), deleteNamedAgent(id). Implement `resolveAgent(taskType, projectId)` that looks up the agentProviderDefaults for the task type, finds the associated named agent via namedAgentId, and returns { provider, model, name }. When namedAgentId is null, fall back to the existing provider column with no model override.",
          "acceptance_criteria": "- [ ] `listNamedAgents()` returns all named agents ordered by name\n- [ ] `createNamedAgent()` validates uniqueness of name and valid provider enum\n- [ ] `updateNamedAgent()` updates specified fields only\n- [ ] `deleteNamedAgent()` removes agent and nullifies any referencing agentProviderDefaults rows\n- [ ] `resolveAgent()` returns correct { provider, model, name } for a given task type\n- [ ] `resolveAgent()` falls back to raw provider when namedAgentId is null\n- [ ] Duplicate name creation returns appropriate error",
          "status": "in_progress",
          "position": 2
        },
        {
          "id": "ksaOnb7zB-rR",
          "title": "As a user, I want API routes for managing named agents so that the UI can perform CRUD operations",
          "description": "Create API routes at `/api/agent-config/named-agents` for GET (list), POST (create) and `/api/agent-config/named-agents/[agentId]` for PUT (update), DELETE. Update the existing provider defaults API endpoint to accept `namedAgentId` in addition to or instead of raw `provider`. Update all dispatch routes (build at `/api/projects/[projectId]/epics/[epicId]/build`, review routes, chat routes) to use `resolveAgent()` for determining which provider and model to use when spawning.",
          "acceptance_criteria": "- [ ] GET `/api/agent-config/named-agents` returns list of all named agents\n- [ ] POST `/api/agent-config/named-agents` creates a named agent and returns it\n- [ ] PUT `/api/agent-config/named-agents/[agentId]` updates a named agent\n- [ ] DELETE `/api/agent-config/named-agents/[agentId]` deletes a named agent\n- [ ] Provider defaults API accepts namedAgentId field\n- [ ] Build route uses resolveAgent() to determine provider and model\n- [ ] Review routes use resolveAgent() to determine provider and model\n- [ ] Chat routes use resolveAgent() to determine provider and model\n- [ ] Model is passed through to spawn functions for all three providers",
          "status": "in_progress",
          "position": 3
        },
        {
          "id": "a0kB6w4Q7bWO",
          "title": "As a user, I want an Agents tab in settings to create and manage my named agents",
          "description": "Add a new 'Agents' tab in the agent configuration side panel (alongside existing Providers tab). The tab displays a list of named agents with their name, provider icon/label, and model. Each row has edit and delete actions. A 'New Agent' button opens a form with: name (text input), provider (dropdown: Claude Code, Codex, Gemini CLI), and model (text input with placeholder examples per provider). Validate that name is unique before saving.",
          "acceptance_criteria": "- [ ] New 'Agents' tab appears in agent settings side panel\n- [ ] Tab lists all existing named agents with name, provider, and model\n- [ ] 'New Agent' button opens creation form\n- [ ] Form has name input, provider dropdown (3 options), and model text input\n- [ ] Model input shows provider-appropriate placeholder (e.g., 'claude-sonnet-4-5-20250929' for CC)\n- [ ] Edit action opens pre-filled form for updating\n- [ ] Delete action shows confirmation and removes the agent\n- [ ] Duplicate name validation shows error message\n- [ ] UI uses existing shadcn/ui components and dark mode styling",
          "status": "in_progress",
          "position": 4
        },
        {
          "id": "GVfGWVDZV40J",
          "title": "As a user, I want to assign named agents to task types so that each task type uses a specific CLI and model combination",
          "description": "Update the existing Providers tab (now renamed to 'Task Assignments' or similar) to show a named agent dropdown per task type (build, review_security, review_ux, review_a11y, review_general, chat) instead of the raw provider dropdown. The dropdown lists all named agents by name. When a named agent is selected, the agentProviderDefaults row is updated with the namedAgentId. Display the current assignment clearly showing agent name, provider, and model.",
          "acceptance_criteria": "- [ ] Providers tab shows named agent dropdown per task type\n- [ ] Dropdown lists all named agents by name with provider/model as secondary info\n- [ ] Selecting a named agent updates agentProviderDefaults with namedAgentId\n- [ ] Current assignment displays agent name, provider icon, and model\n- [ ] If no named agents exist, tab shows message directing user to create agents first\n- [ ] Changes persist immediately (no separate save button needed)\n- [ ] Backward compatible: existing raw provider assignments still work until reassigned",
          "status": "in_progress",
          "position": 5
        }
      ]
    },
    {
      "id": "OiiNeP8pP8Zl",
      "title": "Permanent Delete Actions for Epic and User Story Detail",
      "description": "Add destructive delete actions directly in Epic Detail and User Story (US) Detail views, with explicit confirmation and immediate permanent deletion (no recovery, undo, or trash).\n\nImplementation plan:\n1. Add a `Delete` action in the danger zone of Epic Detail and US Detail, visible only to users who already have edit/delete permissions.\n2. Implement a shared confirmation dialog used by both pages with irreversible copy (`This action cannot be undone`), Cancel, and Confirm actions.\n3. Wire/extend backend `DELETE` handlers for epics and user stories to perform transactional hard deletes only.\n4. Ensure relationship handling is deterministic: deleting an epic removes its child user stories and dependent planning artifacts in the same transaction; deleting a US removes its dependent links/comments/tasks per FK rules with no partial writes.\n5. On successful deletion, redirect to the correct parent list view (epics/backlog), invalidate cached queries, and refresh UI state so removed items disappear from detail, kanban, and lists immediately.\n6. Add regression coverage for confirmation, successful deletion, authorization, and failure paths for both entity types.",
      "priority": 0,
      "status": "done",
      "position": 5,
      "branchName": null,
      "user_stories": [
        {
          "id": "IkmeYO0xDLam",
          "title": "As a project collaborator, I want to delete an epic from Epic Detail so that I can permanently remove obsolete initiatives without leaving the page",
          "description": "Expose a destructive `Delete Epic` action on the Epic Detail screen. The action must require explicit confirmation and execute a hard delete immediately after confirmation.",
          "acceptance_criteria": "- [ ] Epic Detail displays a visible `Delete Epic` action in a danger-zone section for authorized users.\n- [ ] Clicking `Delete Epic` opens a confirmation dialog with irreversible warning text.\n- [ ] Confirm triggers exactly one delete request and shows a loading/disabled state until completion.\n- [ ] After success, the epic is permanently removed and no longer appears in epic lists or detail views.",
          "status": "review",
          "position": 0
        },
        {
          "id": "RZyZPsStVezm",
          "title": "As a project collaborator, I want to delete a user story from US Detail so that I can permanently remove invalid or duplicate work items quickly",
          "description": "Expose a destructive `Delete User Story` action on the US Detail screen with the same confirmation and hard-delete behavior used for epics.",
          "acceptance_criteria": "- [ ] US Detail displays a visible `Delete User Story` action in a danger-zone section for authorized users.\n- [ ] Clicking `Delete User Story` opens the confirmation dialog with irreversible warning text.\n- [ ] Confirm performs a hard delete for that user story with in-flight protection against double submit.\n- [ ] After success, the user story is removed from backlog/kanban/detail state.",
          "status": "review",
          "position": 1
        },
        {
          "id": "jwaF2fxk3Cx9",
          "title": "As a platform maintainer, I want epic and user story deletions to be transactional hard deletes so that data integrity is preserved without recovery mechanisms",
          "description": "Implement backend deletion semantics that are fully permanent and atomic. There must be no soft-delete flag, no recycle bin, and no partial deletion outcomes.",
          "acceptance_criteria": "- [ ] `DELETE` endpoints for epics and user stories perform hard deletes only (no soft-delete behavior).\n- [ ] Epic delete handles related records in one transaction (child user stories and dependent artifacts), with all-or-nothing behavior.\n- [ ] If any constraint fails, the API returns a clear error and leaves data unchanged.\n- [ ] Existing project authorization rules are enforced before deletion is allowed.",
          "status": "review",
          "position": 2
        },
        {
          "id": "kADaCr-JqGLY",
          "title": "As a project collaborator, I want consistent post-delete navigation and feedback so that I always land in a valid view with up-to-date data",
          "description": "After delete operations, the UI should route users away from removed detail pages, refresh relevant state, and provide clear success/failure feedback.",
          "acceptance_criteria": "- [ ] After epic deletion, navigation redirects to the project epics/kanban context with a success message.\n- [ ] After user story deletion, navigation redirects to the parent epic/backlog context with a success message.\n- [ ] Client cache/query state is invalidated so deleted entities disappear without manual refresh.\n- [ ] Automated tests cover confirm, success, authorization failure, and backend error scenarios for both delete flows.",
          "status": "review",
          "position": 3
        }
      ]
    },
    {
      "id": "hE_y7B4pzR9r",
      "title": "All agents mustr be using worktree, no branches",
      "description": null,
      "priority": 2,
      "status": "done",
      "position": 6,
      "branchName": null,
      "user_stories": []
    },
    {
      "id": "bkYCsWF9dVB7",
      "title": "Unified Chat Final Cutover: Left Panel Only",
      "description": "Finalize chat convergence by making the left workspace (opened from New Epic and the left Chat button) the only chat interface, with full feature parity and complete migration from the legacy right panel. This epic is a final cutover/decommission effort (not a redesign), aligned with prior work in Unified Chat & Epic Creation Workspace, Fuse New Epic into Chat Panel, Session Management & Monitoring, and Codex Session Tracking Hardening.\n\nImplementation plan:\n1. Define a strict parity contract from the legacy right panel: tab taxonomy, labels, filters, sorting, status semantics, history behaviors, and chat capabilities.\n2. Implement parity in the left panel using the same canonical chat/session data sources, ensuring all existing chat capabilities remain available.\n3. Build and run a migration that preserves conversation/session/message IDs and metadata (timestamps, project linkage, statuses), with validation reports and backup before cutover.\n4. Execute a big-bang cutover: left panel becomes the single entry point; right panel UI and triggers are removed.\n5. Decommission legacy technical surface: routes, stores, hooks, components, feature flags, and obsolete services tied to the right panel.\n6. Validate with automated and manual regression checks, including session continuity, history completeness, tab behavior parity, and no data loss.\n\nOut of scope: historical deep-link/bookmark redirection from the old right chat panel.",
      "priority": 0,
      "status": "done",
      "position": 7,
      "branchName": null,
      "user_stories": [
        {
          "id": "V8zEPWTRw1ai",
          "title": "As a product user, I want the left chat panel to provide the full chat workspace so that I can use one interface with all chat features.",
          "description": "Unify New Epic entry and left Chat button into a single chat workspace that includes complete conversation history and the same tab taxonomy previously available in the right panel. Preserve expected interaction behavior for filters, sorting, and status states.",
          "acceptance_criteria": "- [ ] Opening chat from New Epic and from the left Chat button lands in the same unified chat workspace\n- [ ] The left workspace exposes the full conversation history used by the previous system\n- [ ] Tab taxonomy matches legacy behavior (same tab set, labels, and state semantics)\n- [ ] Filters and sorting options match legacy behavior and produce equivalent results\n- [ ] Existing chat capabilities (message flow, rendering, and context continuity) remain available in the unified panel",
          "status": "review",
          "position": 0
        },
        {
          "id": "-gUbtnIRjzvM",
          "title": "As a project owner, I want all existing conversations migrated with stable IDs so that no historical data is lost or remapped.",
          "description": "Create a migration process that moves legacy right-panel conversations into the unified model while preserving conversation/session/message identifiers and key metadata. Include pre-cutover backup and post-migration integrity checks.",
          "acceptance_criteria": "- [ ] Migration preserves conversation, session, and message IDs exactly\n- [ ] Timestamps, project associations, tab/status metadata, and ordering are preserved\n- [ ] Integrity checks report zero missing and zero duplicate conversations/messages\n- [ ] A backup exists before migration and migration results are logged for auditability",
          "status": "review",
          "position": 1
        },
        {
          "id": "NHqQj-pl1SGx",
          "title": "As an operator, I want unified session tracking in the left workspace so that agent activity and chat continuity stay reliable.",
          "description": "Ensure the left chat panel reads and writes the canonical session tracking layer used by the platform, avoiding split state between old and new systems. Active sessions must remain visible and consistent after cutover.",
          "acceptance_criteria": "- [ ] Left chat uses the canonical session/chat store as the single source of truth\n- [ ] Active sessions remain visible with consistent state transitions after cutover\n- [ ] Session activity displayed in chat aligns with session monitoring data\n- [ ] No divergent session records are created by legacy pathways",
          "status": "review",
          "position": 2
        },
        {
          "id": "7b7W6z_PTrnU",
          "title": "As an end user, I want the legacy right chat system removed so that the product has one clear and consistent chat experience.",
          "description": "Perform a big-bang cutover by removing the right-side chat button, panel, and associated entry points. The left panel becomes the only supported chat entry. No historical deep-link redirection is required.",
          "acceptance_criteria": "- [ ] Right-side chat button is removed from the UI\n- [ ] Legacy right chat panel cannot be opened through the application UI\n- [ ] Left chat panel is the only supported chat entry point\n- [ ] No deep-link redirect handling is implemented for legacy right-panel links",
          "status": "review",
          "position": 3
        },
        {
          "id": "s4UV_eqp0S6e",
          "title": "As a developer, I want legacy right-chat code paths decommissioned so that the codebase is simpler and safer to maintain.",
          "description": "Delete or retire right-panel-specific routes, hooks, stores, components, flags, and services that are no longer needed after cutover. Update architecture/docs to reflect the single chat system.",
          "acceptance_criteria": "- [ ] Legacy right-chat routes/components/hooks/stores/services are removed or fully detached\n- [ ] Dead feature flags and obsolete config tied to right chat are removed\n- [ ] Build and type checks pass with no references to removed right-chat modules\n- [ ] Technical docs are updated to describe the left-panel-only chat architecture",
          "status": "review",
          "position": 4
        },
        {
          "id": "zbLyZiXLiTZn",
          "title": "As a QA lead, I want regression coverage for the unified chat cutover so that release risk is controlled.",
          "description": "Add automated and manual test coverage to prove parity, migration integrity, and cutover correctness. Validate core user journeys across ideation/spec/planning workflows that rely on chat.",
          "acceptance_criteria": "- [ ] Automated tests cover tab taxonomy behavior, history retrieval, and filter/sort parity in left chat\n- [ ] Automated tests validate migration integrity (ID preservation, completeness, no duplicates)\n- [ ] End-to-end tests confirm right chat entry points are removed and left chat remains functional\n- [ ] Manual UAT checklist is completed for key workflows that depend on chat\n- [ ] Release sign-off requires zero critical defects related to chat convergence",
          "status": "review",
          "position": 5
        }
      ]
    },
    {
      "id": "-V-5ggVwUD6Q",
      "title": "Project Document Registry & @Filename Agent Context Injection",
      "description": "Implement a project-scoped document registry that standardizes storage and powers @filename mentions across the app. Phase 1: add a documents persistence model (projectId, originalFilename, kind=text|image, markdownContent, imagePath, mimeType, size, timestamps) with a case-insensitive unique constraint per project on filename. Phase 2: build ingestion rules—text files are converted to markdown at upload and only markdown is stored in DB; images are stored on disk and only their path/metadata is stored in DB. Phase 3: deliver a unified Docs tab listing all uploaded docs (text + image) by original filename with delete actions. Phase 4: add @mention autocomplete/parser in all editors and validate mentions at submit time. Phase 5: integrate mention resolution into dispatch so each send resolves docs and enriches the final prompt before CLI execution: full markdown for text, filesystem path sentence for images; keep this provider-agnostic and route through resolveAgent() to pass provider/model correctly for Claude Code and Gemini CLI headless flows. Phase 6: add migration, API, and integration coverage for upload/list/delete/mention/dispatch behavior, including deletion and cross-project isolation.",
      "priority": 0,
      "status": "done",
      "position": 8,
      "branchName": null,
      "user_stories": [
        {
          "id": "nW2ILKA3PRZg",
          "title": "As a project contributor, I want uploads to enforce unique filenames per project and store documents by canonical type so that references are deterministic",
          "description": "Create a single upload contract for documents. For text-like files, convert at ingest to markdown and store markdown in DB only. For images, persist the file in project storage and store path metadata in DB. Enforce filename uniqueness within a project to prevent ambiguous mentions.",
          "acceptance_criteria": "- [ ] Upload API rejects duplicate original filenames within the same project (case-insensitive) for both text and image uploads.\n- [ ] Text uploads are converted to markdown during ingestion and only markdown is persisted in the database.\n- [ ] Image uploads are persisted to filesystem storage and the database stores only path + metadata (no image binary in DB).\n- [ ] The same filename is allowed in different projects.",
          "status": "done",
          "position": 0
        },
        {
          "id": "GM_Hq5-Dm_94",
          "title": "As a project contributor, I want a unified Docs tab with text and image documents so that I can manage all context assets in one place",
          "description": "Add a Docs tab view that lists every uploaded document for the active project using the original filename as the primary label. Include document type and key metadata, and provide delete actions.",
          "acceptance_criteria": "- [ ] Docs tab lists both markdown-backed text documents and image documents in one table/list scoped to the active project.\n- [ ] Each row shows the original filename and document type, with stable identifiers for mention resolution.\n- [ ] Deleting a text document removes its DB record.\n- [ ] Deleting an image document removes both its DB record and the stored file path target from disk.",
          "status": "done",
          "position": 1
        },
        {
          "id": "5r_gnCbARDTH",
          "title": "As a project contributor, I want to @mention documents in all editors so that I can attach existing project context without copy-pasting",
          "description": "Implement @filename support in every editor surface (chat, epic/story/ticket inputs, review/build prompts, and other text-entry points). Provide autocomplete from the project document registry and parser support for multiple mentions.",
          "acceptance_criteria": "- [ ] Typing `@` in any supported editor opens a picker of project document filenames.\n- [ ] Selecting a document inserts a mention token that preserves the original filename.\n- [ ] Multiple document mentions are supported in a single message.\n- [ ] Submitting with unknown/deleted mentions is blocked with a clear validation error.",
          "status": "done",
          "position": 2
        },
        {
          "id": "aDK9WhoIhZTh",
          "title": "As the orchestration system, I want mention-aware prompt enrichment before agent execution so that providers receive complete and correct context",
          "description": "At dispatch time, resolve all mentioned filenames to stored documents and append provider-agnostic context blocks to the outgoing prompt. For text documents, inject full markdown content. For images, inject a path-based instruction block. Integrate this into the shared dispatch path that uses resolveAgent() to select provider/model.",
          "acceptance_criteria": "- [ ] Dispatch resolves mentions to document records in the active project before CLI invocation.\n- [ ] For text mentions, the full markdown content is injected (no truncation/token cap in v1).\n- [ ] For image mentions, prompt enrichment includes a sentence with the filesystem path (no inline image bytes).\n- [ ] Enrichment runs through the shared dispatch layer and works for both Claude Code and Gemini CLI flows using provider/model from `resolveAgent()`.",
          "status": "done",
          "position": 3
        },
        {
          "id": "WL7ZYVLXgmOe",
          "title": "As an engineer, I want migration and end-to-end coverage for document mentions and dispatch so that regressions are prevented",
          "description": "Ship schema migration(s), API tests, and integration tests that validate ingestion, listing, deletion, mention parsing, and provider dispatch payload construction.",
          "acceptance_criteria": "- [ ] Migration adds required document schema and case-insensitive unique filename index per project.\n- [ ] Tests cover upload conversion behavior, duplicate rejection, docs listing, and delete semantics for text and image.\n- [ ] Tests verify mention resolution failure modes (missing/deleted docs, cross-project isolation).\n- [ ] Integration tests verify enriched prompts sent to both Claude and Gemini providers contain expected markdown/path context blocks.",
          "status": "done",
          "position": 4
        }
      ]
    },
    {
      "id": "rfLg9nrUsNoq",
      "title": "Kanban Ticket Cards: Agent Activity, Hover Link, and Unread AI Indicator",
      "description": "Implement a focused Kanban ticket-card UX epic that adds visual agent signals and card-to-agent interaction without changing agent orchestration/dispatch logic.\n\nImplementation plan:\n1. Scope and boundaries\n- Limit changes to Kanban ticket cards, shared frontend state wiring, and bottom agent panel highlighting.\n- Reuse existing runtime ticket/agent state; do not change backend workflows for build/review/merge.\n\n2. Agent activity icon on ticket cards\n- Add a single activity icon slot on each ticket card for active agent work.\n- Map action type to icon: `build`, `review`, `merge`.\n- Render only when the ticket has an active agent action; hide otherwise.\n- Add tooltip and aria-label with action type and agent name.\n\n3. Hover link between ticket card and bottom agent panel\n- On ticket-card hover/focus, emit selected agent context to bottom panel.\n- Bottom panel highlights only the linked agent card/row; remove highlight on unhover/blur.\n- Safely no-op if ticket has no linked active agent.\n\n4. Unread AI last-message indicator (session-scoped)\n- Show an unread indicator on ticket card when the latest ticket comment is AI-originated (including system/status messages) and has not been seen in the current browser session.\n- Persist seen state in `sessionStorage` (project+ticket scoped), not user-global persistence.\n- Clear unread indicator immediately when ticket is opened.\n\n5. UI cohabitation and accessibility\n- Define deterministic placement when both activity and unread indicators are present.\n- Ensure contrast, tooltip text, keyboard focus behavior, and aria labels are compliant.\n\n6. Validation and regression safety\n- Add component tests for icon mapping/visibility and unread logic.\n- Add integration/E2E tests for hover highlight lifecycle and unread-clearing-on-open.\n- Verify no regressions in Kanban drag-and-drop, ticket open flow, or bottom panel rendering.",
      "priority": 0,
      "status": "done",
      "position": 9,
      "branchName": null,
      "user_stories": [
        {
          "id": "cWob8uyuy-Bg",
          "title": "As a project manager, I want a distinct icon for build/review/merge activity on each ticket card so that I can instantly see what kind of agent work is running",
          "description": "Add one action-specific activity icon to each Kanban ticket card when an agent is actively working on that ticket. The icon must reflect the action type (`build`, `review`, `merge`) and be sourced from existing frontend runtime state. This is a visual layer only and must not alter orchestration rules.",
          "acceptance_criteria": "- [ ] A ticket with active `build` work shows the build icon; active `review` shows review icon; active `merge` shows merge icon.\n- [ ] Tickets without active agent work show no activity icon.\n- [ ] The activity icon has a tooltip and aria-label including action type and agent identity.\n- [ ] Rendering logic is frontend-only and does not modify dispatch/orchestration behavior.",
          "status": "review",
          "position": 0
        },
        {
          "id": "DMvyIDILAtx-",
          "title": "As a project manager, I want hovering a ticket card to highlight its linked agent in the bottom panel so that I can quickly connect work items to active agents",
          "description": "Create a hover/focus interaction bridge between Kanban ticket cards and the bottom agent panel. Hovering (or keyboard focusing) a card should highlight the corresponding agent entry; leaving hover/focus should remove the highlight cleanly.",
          "acceptance_criteria": "- [ ] Mouse enter on a ticket card highlights the linked agent in the bottom panel.\n- [ ] Mouse leave removes the highlight immediately.\n- [ ] Keyboard focus/blur on the ticket card triggers the same highlight behavior.\n- [ ] If no linked agent exists for the card, no highlight is applied and no error is thrown.\n- [ ] At most one agent is highlighted per hovered/focused card.",
          "status": "review",
          "position": 1
        },
        {
          "id": "usPt0zV5A0Vn",
          "title": "As a project manager, I want an unread AI indicator on ticket cards when the latest AI message has not been seen in my session so that I do not miss agent feedback",
          "description": "Show an unread badge/icon on a ticket card when the most recent ticket comment was posted by AI (including system/status messages) and has not been viewed in the current browser session. The indicator must clear as soon as the ticket is opened.",
          "acceptance_criteria": "- [ ] If the latest comment is AI-originated (including system/status messages) and unseen in session, the ticket card shows an unread AI indicator.\n- [ ] If the latest comment is user-originated, no unread AI indicator is shown.\n- [ ] Opening the ticket clears the unread AI indicator immediately.\n- [ ] Seen/unseen state is tracked per browser session (session-scoped), not persisted as a global user read receipt.\n- [ ] After clearing, the indicator reappears only when a newer AI/system message becomes the latest comment.",
          "status": "review",
          "position": 2
        },
        {
          "id": "7mbJlM0ys5D9",
          "title": "As a maintainer, I want consistent indicator layout and automated test coverage so that these UI signals remain reliable as the Kanban evolves",
          "description": "Finalize placement, priority, and accessibility for ticket-card indicators and validate the full behavior with automated tests. This ensures visual clarity and protects against regressions in Kanban and agent panel interactions.",
          "acceptance_criteria": "- [ ] Activity and unread indicators can co-exist on the same card with deterministic placement and no overlap.\n- [ ] Indicator visuals meet baseline accessibility requirements (contrast, aria labels, focus behavior).\n- [ ] Component tests cover icon mapping, conditional rendering, and unread state transitions.\n- [ ] Integration/E2E tests cover hover-highlight enter/leave and unread-clear-on-open flows.\n- [ ] Existing Kanban card interactions (including opening tickets) continue to function without regression.",
          "status": "review",
          "position": 3
        }
      ]
    },
    {
      "id": "VRdio3CkqX_4",
      "title": "Le comment a la suite d'une feature est un comment technique en JSON au lieu d'un message pour l'utilisateur",
      "description": "Agent13 févr., 15:17\n\nFeature Review\n\n{ \"type\": \"result\", \"subtype\": \"success\", \"is_error\": false, \"duration_ms\": 147329, \"duration_api_ms\": 383173, \"num_turns\": 15, \"result\": \"\", \"stop_reason\": null, \"session_id\": \"a60e829b-df63-4d9b-8f7b-57c0b9d0749b\", \"total_cost_usd\": 1.1176163000000003, \"usage\": { \"input_tokens\": 2056, \"cache_creation_input_tokens\": 28321, \"cache_read_input_tokens\": 373429, \"output_tokens\": 4589, \"server_tool_use\": { \"web_search_requests\": 0, \"web_fetch_requests\": 0 }, \"service_tier\": \"standard\", \"cache_creation\": { \"ephemeral_1h_input_tokens\": 28321, \"ephemeral_5m_input_tokens\": 0 }, \"inference_geo\": \"\", \"iterations\": [], \"speed\": \"standard\" }, \"modelUsage\": { \"claude-opus-4-6\": { \"inputTokens\": 2056, \"outputTokens\": 4589, \"cacheReadInputTokens\": 373429, \"cacheCreationInputTokens\": 28321, \"webSearchRequests\": 0, \"costUSD\": 0.48872575, \"contextWindow\": 200000, \"maxOutputTokens\": 32000 }, \"claude-haiku-4-5-20251001\": { \"inputTokens\": 46153, \"outputTokens\": 32069, \"cacheReadInputTokens\": 2335638, \"cacheCreationInputTokens\": 151063, \"webSearchRequests\": 0, \"costUSD\": 0.6288905500000002, \"contextWindow\": 200000, \"maxOutputTokens\": 64000 } }, \"permission_denials\": [], \"uuid\": \"397c9394-0d79-4bd4-a3a8-6ec5a13b066e\" }",
      "priority": 2,
      "status": "done",
      "position": 10,
      "branchName": null,
      "user_stories": []
    },
    {
      "id": "wHh9OkV7DiqR",
      "title": "Codex Session Tracking Hardening and Sessions Viewer Upgrade",
      "description": "Fix Codex telemetry correctness and improve sessions UI readability for long logs. Provide server-derived status text and contained scrollable viewers for responses, raw logs, and output.",
      "priority": 2,
      "status": "done",
      "position": 11,
      "branchName": null,
      "user_stories": [
        {
          "id": "rsEIf2Wm4sWL",
          "title": "As an engineer, I want stable Codex session and response linkage so that each log chunk is attached to the correct run",
          "description": "Harden session lifecycle transitions and append ordering in backend ingestion paths.",
          "acceptance_criteria": "- [ ] Session status transitions are consistent across running, completed, and failed states\\n- [ ] Response and raw log chunks retain deterministic ordering\\n- [ ] No log chunk is attached to the wrong session under concurrent activity\\n- [ ] Regression tests cover parallel session ingestion scenarios",
          "status": "todo",
          "position": 0
        },
        {
          "id": "SNvOWnLuNW3D",
          "title": "As a user, I want last non-empty output text displayed for active sessions so that I can track progress quickly",
          "description": "Derive and expose a concise last non-empty text field from Codex output and display it next to elapsed time for running sessions.",
          "acceptance_criteria": "- [ ] Backend exposes `lastNonEmptyText` for active and completed sessions\\n- [ ] Extraction ignores blank and whitespace-only lines\\n- [ ] Sessions list shows elapsed time plus last non-empty text when available\\n- [ ] Field updates incrementally as new output arrives",
          "status": "todo",
          "position": 1
        },
        {
          "id": "wao0PDgUsa6l",
          "title": "As a user, I want response, raw log, and output displayed in scrollable viewers so that long content does not break layout",
          "description": "Refactor sessions tab content areas into fixed-height, monospace, scrollable panes with wrapping behavior tuned for readability.",
          "acceptance_criteria": "- [ ] Responses, raw logs, and output each render inside contained scroll areas\\n- [ ] No horizontal spillover outside card or panel boundaries\\n- [ ] Monospace rendering with pre-wrap preserves readability for mixed long lines and JSON\\n- [ ] Large payload rendering remains responsive on typical local machines",
          "status": "todo",
          "position": 2
        },
        {
          "id": "8Q1fhsVBbcUn",
          "title": "As QA, I want automated checks for session rendering and overflow behavior so that regressions are caught early",
          "description": "Add unit and integration tests for session parsing, last text extraction, and visual containment constraints.",
          "acceptance_criteria": "- [ ] Unit tests validate last non-empty text extraction edge cases\\n- [ ] Integration tests validate session list updates during active runs\\n- [ ] UI tests cover overflow and scroll behavior for long response and log content\\n- [ ] Test suite passes in CI or local verification pipeline",
          "status": "todo",
          "position": 3
        }
      ]
    },
    {
      "id": "30KYsiuYRbxy",
      "title": "When asking review or merge, the icon and type of agent in the bottom is still build",
      "description": "When asking review or merge, the icon and type of agent in the bottom is still build",
      "priority": 2,
      "status": "done",
      "position": 12,
      "branchName": null,
      "user_stories": []
    },
    {
      "id": "LnfKHr0A1WGo",
      "title": "WHen creating a bug, a button Create And FIx should be present",
      "description": "WHen creating a bug, a button Create And FIx, which should start an agent to solve it, should be present, but it's not.",
      "priority": 2,
      "status": "done",
      "position": 13,
      "branchName": null,
      "user_stories": []
    },
    {
      "id": "pIhpD8Ov9mnP",
      "title": "When asking for a review the agent should always leave a comment",
      "description": "When asking for a review the agent should always leave a comment",
      "priority": 2,
      "status": "done",
      "position": 14,
      "branchName": "feature/epic-pIhpD8Ov9mnP-when-asking-for-a-review-the-agent-shoul",
      "user_stories": []
    },
    {
      "id": "LlZW_DN8jpQ9",
      "title": "I ask for a review, and CC is used, despite the fact I specified Codex in the settings",
      "description": null,
      "priority": 2,
      "status": "done",
      "position": 15,
      "branchName": null,
      "user_stories": []
    },
    {
      "id": "li_RkutPB9BE",
      "title": "Bug Tickets with Direct Creation and Agent Dispatch",
      "description": "Add a new 'bug' ticket type to the existing kanban system. Bugs are standalone kanban cards that reuse the epics table (with a new `type` column: 'feature' | 'bug') and the full dispatch/worktree/PR pipeline. Bugs have a simplified creation flow — a direct form (title, description, images) with no mandatory chat step. They can optionally link to an existing epic. A 'Create and Resolve' action creates the bug and immediately dispatches a selected agent (via the existing provider/agent selector) in an isolated worktree+branch. Bug cards have a distinct background color on the kanban board.\n\n## Implementation Plan\n\n1. Schema migration: Add `type` column ('feature'|'bug') to `epics` table (default 'feature'), add optional `linkedEpicId` self-referencing FK, add `images` JSON column for bug attachments.\n2. API routes: New POST `/api/projects/[id]/bugs` for direct creation (no chat), POST `/api/projects/[id]/bugs/create-and-resolve` that creates + dispatches agent. Existing epic routes continue working unchanged.\n3. Bug creation form: Modal/panel with title, description, image upload (reuse existing image infra from chat), optional epic linker dropdown, and agent selector for 'Create and Resolve'.\n4. Kanban integration: Filter/display bugs alongside epics, distinct BG color for bug cards, badge or icon to distinguish type. Drag-and-drop, status transitions, and column behavior remain identical.\n5. Agent dispatch: Reuse existing worktree+branch creation and agent dispatch logic. When linked to an epic, inject epic context (title, description, user stories) into the agent prompt.\n6. Bug detail view: Lighter version of epic detail — shows title, description, images, linked epic, status, and agent session if dispatched.",
      "priority": 0,
      "status": "done",
      "position": 16,
      "branchName": null,
      "user_stories": [
        {
          "id": "UxbRexAi9JJG",
          "title": "As a developer, I want a `type` column on the epics table so that bugs and features share the same kanban infrastructure",
          "description": "Add a `type` column to the `epics` table with values 'feature' (default) and 'bug'. Add an optional `linkedEpicId` column as a self-referencing foreign key for bugs that relate to an epic. Add an `images` JSON column to store uploaded image paths/URLs for bug reports. Generate and push the Drizzle migration. Ensure all existing epics default to type 'feature' and all existing queries/API routes continue to work without changes.",
          "acceptance_criteria": "- [ ] `type` column added to `epics` schema with 'feature' | 'bug' enum, defaulting to 'feature'\n- [ ] `linkedEpicId` column added as optional self-referencing FK\n- [ ] `images` JSON column added for storing image references\n- [ ] Drizzle migration generated and applied successfully\n- [ ] All existing epics have type 'feature' after migration\n- [ ] Existing epic CRUD and kanban functionality unaffected",
          "status": "review",
          "position": 0
        },
        {
          "id": "m_LYreWVfaHp",
          "title": "As a user, I want a 'New Bug' button on the kanban board so that I can report bugs without going through a chat workflow",
          "description": "Add a 'New Bug' button (visually distinct from 'New Epic') to the kanban board header or column. Clicking it opens a bug creation form/modal with fields: title (required), description (required), image upload (optional, multiple), and an optional epic linker dropdown that lists existing feature-type epics. The form submits directly to a new API route and creates the bug ticket in the selected kanban column (default: first column / backlog). No chat agent interaction is required.",
          "acceptance_criteria": "- [ ] 'New Bug' button visible on the kanban board, visually distinct from epic creation\n- [ ] Bug creation form includes title, description, image upload, and optional epic link\n- [ ] Image upload supports multiple images with preview\n- [ ] Epic linker dropdown shows only feature-type epics from the current project\n- [ ] Form submission creates a bug-type record in the epics table via API\n- [ ] Bug appears on the kanban board immediately after creation\n- [ ] Form validates required fields (title, description) before submission",
          "status": "review",
          "position": 1
        },
        {
          "id": "aJBffzelyvoA",
          "title": "As a user, I want a 'Create and Resolve' action so that I can report a bug and immediately dispatch an agent to fix it",
          "description": "Add a 'Create and Resolve' button alongside the regular 'Create' button in the bug creation form. This action creates the bug ticket AND immediately dispatches the selected agent to work on it. The agent selector (reusing existing provider/agent selector component) must be visible when 'Create and Resolve' is chosen. The dispatch creates an isolated worktree+branch (reusing existing infrastructure), generates a prompt from the bug details, and if the bug is linked to an epic, includes the epic's title, description, and user stories in the agent prompt for context.",
          "acceptance_criteria": "- [ ] 'Create and Resolve' button present in bug creation form\n- [ ] Agent/provider selector appears when 'Create and Resolve' is intended\n- [ ] Bug ticket is created in the database before dispatch\n- [ ] Agent is dispatched in an isolated worktree with a dedicated branch\n- [ ] Agent prompt includes bug title, description, and images\n- [ ] When linked to an epic, agent prompt also includes epic title, description, and user stories\n- [ ] Bug status is set to 'in-progress' (or appropriate column) after dispatch\n- [ ] Session tracking is established for the dispatched agent (reusing existing session infra)",
          "status": "review",
          "position": 2
        },
        {
          "id": "bL3zMk5ylqt2",
          "title": "As a user, I want bug cards to have a distinct background color on the kanban board so that I can visually distinguish them from feature epics",
          "description": "Bug-type cards on the kanban board should render with a different background color (e.g., a subtle red/orange tint in dark mode) compared to feature epics. Add a small bug icon or badge on the card to reinforce the distinction. The card layout remains the same (title, status, assignee indicators) but the visual treatment makes bugs immediately identifiable at a glance. Ensure the color works well in the existing dark-mode theme.",
          "acceptance_criteria": "- [ ] Bug cards have a visually distinct background color from feature epic cards\n- [ ] A bug icon or type badge is displayed on bug cards\n- [ ] Color scheme works well in dark mode (default theme)\n- [ ] Bug and feature cards remain consistent in layout and size\n- [ ] Drag-and-drop behavior is identical for bugs and features\n- [ ] Column counts/filters correctly reflect mixed bug+feature content",
          "status": "review",
          "position": 3
        },
        {
          "id": "VWNFIbfwBDcF",
          "title": "As a user, I want to view and manage bug details so that I can track bug resolution progress",
          "description": "Create a bug detail view (lighter variant of the epic detail panel) that shows: title, description, attached images (viewable/zoomable), linked epic (clickable link to epic detail), current status, and agent session details if an agent was dispatched. Allow editing title and description inline. Show the agent session log/output if 'Create and Resolve' was used. The detail view should open when clicking a bug card on the kanban board.",
          "acceptance_criteria": "- [ ] Clicking a bug card opens the bug detail view\n- [ ] Detail view displays title, description, images, linked epic, and status\n- [ ] Images are viewable with a reasonable preview/zoom\n- [ ] Linked epic is shown as a clickable link that navigates to the epic detail\n- [ ] Agent session section appears when a session exists for this bug\n- [ ] Title and description are editable inline\n- [ ] Status can be changed from the detail view",
          "status": "review",
          "position": 4
        },
        {
          "id": "Mhh1jWEfv1Po",
          "title": "As a user, I want the API to support bug-specific operations so that the frontend can create, list, and manage bugs",
          "description": "Implement API routes for bug operations: POST `/api/projects/[id]/bugs` for direct creation (title, description, images, optional linkedEpicId), POST `/api/projects/[id]/bugs/create-and-resolve` that creates and dispatches an agent, and ensure existing GET/PATCH/DELETE epic routes handle both types transparently. The existing kanban data fetching should return both features and bugs with their type clearly indicated. Image upload should reuse existing upload infrastructure or use a simple local file storage approach.",
          "acceptance_criteria": "- [ ] POST `/api/projects/[id]/bugs` creates a bug-type epic with title, description, images, and optional linkedEpicId\n- [ ] POST `/api/projects/[id]/bugs/create-and-resolve` creates bug and triggers agent dispatch\n- [ ] Existing GET endpoints for kanban/epics return both types with `type` field\n- [ ] PATCH/DELETE routes work for both bug and feature types\n- [ ] Image upload endpoint handles multiple images and stores references\n- [ ] API responses follow existing `{ data }` / `{ error }` conventions\n- [ ] Input validation via appropriate schemas (title required, description required)",
          "status": "review",
          "position": 5
        }
      ]
    },
    {
      "id": "vAR_xx1Qr69i",
      "title": "Project Import (Existing Codebase Analysis)",
      "description": "Import an existing project by pointing to a local directory. Claude Code analyzes the codebase and generates epics/user stories with confidence scores. User can preview and edit before importing.",
      "priority": 0,
      "status": "done",
      "position": 17,
      "branchName": null,
      "user_stories": [
        {
          "id": "VFn1DLHMbWuQ",
          "title": "Select project folder for import",
          "description": "As a developer, I want to provide the path to an existing project folder, so that Arij can analyze it.",
          "acceptance_criteria": "- [x] Path input field with folder icon\n- [x] Analyze button disabled when path is empty\n- [x] Loading state during analysis\n- [ ] Path validation (directory exists)\n- [ ] Tests",
          "status": "done",
          "position": 0
        },
        {
          "id": "n90yheKiA4f9",
          "title": "Analyze existing codebase with Claude Code",
          "description": "As a developer, I want Claude Code to scan my codebase and identify epics, user stories, and their statuses, so that I can start from an accurate project state.",
          "acceptance_criteria": "- [x] Claude Code spawned in analyze mode with restricted tools\n- [x] Structured prompt requesting JSON output with project info, epics, US\n- [x] Confidence scores and evidence for each status assessment\n- [x] Robust JSON parsing with fallbacks\n- [ ] Tests for import API and JSON parsing",
          "status": "done",
          "position": 1
        },
        {
          "id": "fp7B8i4RCOKG",
          "title": "Preview and edit imported data before saving",
          "description": "As a developer, I want to review and adjust the detected epics and user stories before they are saved, so that the import is accurate.",
          "acceptance_criteria": "- [x] Editable project name and description\n- [x] Epic list with inline editing and delete\n- [x] User stories displayed within epics\n- [x] Status badges with color coding\n- [x] Confidence percentage display\n- [x] Validate & Import button creates project + epics + US in DB\n- [ ] Tests",
          "status": "done",
          "position": 2
        }
      ]
    },
    {
      "id": "fCWp3o1-jVCK",
      "title": "Release Workflow with GitHub Draft and Publish",
      "description": "Extend releases to support pushing tags, creating draft GitHub releases, and publishing from Arij UI.",
      "priority": 2,
      "status": "done",
      "position": 18,
      "branchName": null,
      "user_stories": [
        {
          "id": "p5wy0YeiJLD9",
          "title": "As a release manager, I want release records linked to GitHub releases so that local and remote release states stay aligned",
          "description": "Add GitHub release metadata fields and extend release creation flow with optional push-and-draft behavior.",
          "acceptance_criteria": "- [ ] `releases` table includes `githubReleaseId`, `githubReleaseUrl`, and `pushedAt`\n- [ ] Release creation endpoint accepts `pushToGitHub`\n- [ ] When enabled, release flow pushes tag and creates a draft GitHub release\n- [ ] Tag push and draft creation outcomes are logged in `git_sync_log`",
          "status": "todo",
          "position": 0
        },
        {
          "id": "DKBk_lWG0wx3",
          "title": "As a release manager, I want a publish endpoint for drafts so that final publication can happen directly from Arij",
          "description": "Implement draft publish API behavior with robust edge-case handling and local status synchronization.",
          "acceptance_criteria": "- [ ] `POST /api/projects/[projectId]/releases/[releaseId]/publish` publishes existing draft release on GitHub\n- [ ] Endpoint handles already-published and missing-release edge cases with explicit errors\n- [ ] Local release record is updated with published state and timestamps after success",
          "status": "todo",
          "position": 1
        },
        {
          "id": "y92WbFNkfIcA",
          "title": "As a release manager, I want GitHub-aware release UI so that I can create, publish, and navigate releases efficiently",
          "description": "Add GitHub controls in release creation and release cards with proper gating and loading states.",
          "acceptance_criteria": "- [ ] Release creation dialog shows `Push to GitHub` checkbox only when GitHub is configured\n- [ ] Release cards show Draft badge, Publish button, and View on GitHub link when applicable\n- [ ] Publish action shows loading/disabled states and prevents duplicate submission\n- [ ] Projects without GitHub config continue to use local release flow with no GitHub controls",
          "status": "todo",
          "position": 2
        }
      ]
    },
    {
      "id": "waYcvnu1h03w",
      "title": "Pull Request Workflow from Epics",
      "description": "Enable one-click push and PR creation from epic context, persist PR metadata, and synchronize status back into Arij UI. This epic extends git sync into full review workflow support.",
      "priority": 2,
      "status": "done",
      "position": 19,
      "branchName": null,
      "user_stories": [
        {
          "id": "um1kPVKISA5V",
          "title": "As a developer, I want epic records to store PR metadata so that PR state is visible in Arij",
          "description": "Extend schema with PR fields and create a pull request table for normalized PR tracking.",
          "acceptance_criteria": "- [ ] `epics` includes `prNumber`, `prUrl`, and `prStatus` fields\\n- [ ] `pullRequests` table exists with project and epic linkage and PR lifecycle fields\\n- [ ] Drizzle migrations are generated and applied cleanly\\n- [ ] Existing epic queries continue to work after schema changes",
          "status": "todo",
          "position": 0
        },
        {
          "id": "GG9aKOHJ_PCU",
          "title": "As a developer, I want Push and Create PR in one action so that I can open review requests quickly",
          "description": "Create an API route that pushes the branch and creates a GitHub PR with generated body content from epic and story data.",
          "acceptance_criteria": "- [ ] PR create endpoint validates GitHub config, branch existence, and token availability\\n- [ ] Endpoint pushes branch before creating PR and handles push errors explicitly\\n- [ ] PR body includes epic summary and story checklist generated from current data\\n- [ ] On success, PR metadata is persisted and linked back to epic",
          "status": "todo",
          "position": 1
        },
        {
          "id": "YGXI73SG-kiQ",
          "title": "As a reviewer, I want PR status badges and sync controls so that I can track open, draft, closed, and merged states",
          "description": "Expose PR status in Epic Detail and allow manual sync from GitHub to refresh current state.",
          "acceptance_criteria": "- [ ] Epic Detail shows create action when no PR exists and status badge when PR exists\\n- [ ] Status sync action updates local PR status from GitHub\\n- [ ] Badge variants cover draft, open, closed, and merged\\n- [ ] Errors during sync are shown non-destructively to the user",
          "status": "todo",
          "position": 2
        },
        {
          "id": "nZtQLYQ8anqc",
          "title": "As a stakeholder, I want PR references on epic cards so that board-level progress includes review status",
          "description": "Show compact PR number and link indicator on epic cards whenever PR metadata exists.",
          "acceptance_criteria": "- [ ] Epic card shows PR icon plus number when `prNumber` is present\\n- [ ] PR indicator links to `prUrl` in a new browser tab\\n- [ ] Card layout remains stable across board columns\\n- [ ] No PR indicator appears for epics without PR metadata",
          "status": "todo",
          "position": 3
        }
      ]
    },
    {
      "id": "3yyClgy0zxHo",
      "title": "Codex Session Tracking Hardening",
      "description": "Stabilize Codex session lifecycle, event ordering, and derived activity summary so monitoring and lock logic are reliable. This epic is foundational for action blocking and sessions UI improvements.",
      "priority": 3,
      "status": "done",
      "position": 20,
      "branchName": null,
      "user_stories": [
        {
          "id": "lme9sddL6uFm",
          "title": "As a project maintainer, I want strict session lifecycle transitions so that running and terminal states are always trustworthy",
          "description": "Implement a server-side lifecycle guard used by all session update paths to prevent invalid status changes and timestamp regressions.",
          "acceptance_criteria": "- [ ] Session transitions are limited to `queued -> running -> completed|failed|cancelled`\n- [ ] Invalid transitions return HTTP 409 with a machine-readable error code\n- [ ] `startedAt` and `endedAt` are set once and are not overwritten by later events\n- [ ] Session list/detail endpoints return the same terminal status for a session once it is completed",
          "status": "review",
          "position": 0
        },
        {
          "id": "JIROShSTCAC0",
          "title": "As a project maintainer, I want ordered Codex chunk persistence so that logs and outputs are always readable in sequence",
          "description": "Persist response, raw log, and output chunks with deterministic per-session sequence metadata and fetch ordering guarantees.",
          "acceptance_criteria": "- [ ] Every chunk written for Codex contains `sessionId`, `streamType`, `sequence`, and timestamp metadata\n- [ ] Sequence numbers are monotonic per session even under concurrent writes\n- [ ] Reads for response/raw/output are sorted by `sequence` ascending\n- [ ] Duplicate chunk inserts with the same unique key are handled idempotently",
          "status": "review",
          "position": 1
        },
        {
          "id": "cKvtDq-q0BRk",
          "title": "As a project maintainer, I want a derived `lastNonEmptyText` so that users can quickly understand active agent progress",
          "description": "Compute and store the last non-empty text from Codex output/response at write time and expose it in sessions APIs.",
          "acceptance_criteria": "- [ ] The backend derives `lastNonEmptyText` from the last non-empty trimmed line of Codex output/response events\n- [ ] Whitespace-only chunks do not overwrite an existing `lastNonEmptyText`\n- [ ] `lastNonEmptyText` is exposed in session list and session detail API payloads\n- [ ] Running session rows render elapsed time and `lastNonEmptyText` together",
          "status": "review",
          "position": 2
        },
        {
          "id": "t8BlUPFVaSRn",
          "title": "As an operator, I want migration and backfill coverage so that older sessions remain usable after schema changes",
          "description": "Add migrations and backfill logic for newly introduced session fields and ensure backward-compatible reads.",
          "acceptance_criteria": "- [ ] Database migration adds required fields and indexes without dropping existing session data\n- [ ] A backfill job populates `lastNonEmptyText` for recent historical sessions when source logs exist\n- [ ] Null-safe handling is in place for older sessions that cannot be backfilled",
          "status": "review",
          "position": 3
        }
      ]
    },
    {
      "id": "U36Sur6N5moa",
      "title": "Git Sync UX in Epic Detail",
      "description": "Expose branch ahead/behind state and push controls directly in epic detail, gated by project GitHub configuration.",
      "priority": 2,
      "status": "done",
      "position": 21,
      "branchName": null,
      "user_stories": [
        {
          "id": "Q6KzqDwPWEKq",
          "title": "As a frontend developer, I want dedicated GitHub and git-status hooks so that sync state is reusable and consistent",
          "description": "Create `useGitHubConfig` and `useGitStatus` hooks with clear loading/error semantics and branch-aware caching.",
          "acceptance_criteria": "- [ ] `useGitHubConfig(projectId)` returns `configured`, `ownerRepo`, `tokenSet`, and `loading`\n- [ ] `useGitStatus(projectId, branchName)` returns `ahead`, `behind`, `loading`, `pushing`, `push()`, and `refresh()`\n- [ ] Hooks debounce duplicate requests and expose normalized error states\n- [ ] Hooks are unit-tested with success and failure scenarios",
          "status": "todo",
          "position": 0
        },
        {
          "id": "pSwu4YMaxpyv",
          "title": "As a product user, I want a Git sync badge so that I can push branches from the epic detail view",
          "description": "Build `GitSyncBadge` with ahead/behind counters, push action, and manual refresh affordance.",
          "acceptance_criteria": "- [ ] `GitSyncBadge` displays ahead/behind badges for the epic branch\n- [ ] `Push to Remote` is disabled when `ahead` is zero or task lock is active\n- [ ] Manual refresh updates counts and loading visuals\n- [ ] Push success/failure produces clear toast feedback",
          "status": "todo",
          "position": 1
        },
        {
          "id": "B_-Berqglykg",
          "title": "As a product user, I want conditional epic integration so that GitHub controls appear only when relevant",
          "description": "Render sync controls only for configured projects with valid branch context and keep local-only workflow unchanged.",
          "acceptance_criteria": "- [ ] Epic detail shows `GitSyncBadge` next to branch metadata only when GitHub is configured and branch exists\n- [ ] UI remains hidden for projects without GitHub configuration\n- [ ] Existing local build/review actions continue to work unchanged",
          "status": "todo",
          "position": 2
        }
      ]
    },
    {
      "id": "D8bDg9BwJDoj",
      "title": "GitHub Remote Foundation and Configuration",
      "description": "Build the minimum GitHub integration layer that enables authenticated API usage and reliable remote git sync while preserving local-only behavior. This epic introduces project-level repository binding, token handling, remote operation endpoints, and operation journaling.",
      "priority": 3,
      "status": "done",
      "position": 22,
      "branchName": null,
      "user_stories": [
        {
          "id": "NoXZGLbI1O1E",
          "title": "As a workspace admin, I want to configure and validate a GitHub PAT so that Arij can call GitHub APIs securely",
          "description": "Add a GitHub section in settings with PAT input, token validation, and persistence in settings storage. Ensure token values are never returned unredacted in read APIs.",
          "acceptance_criteria": "- [ ] Settings page exposes GitHub PAT input with Validate and Save actions\\n- [ ] POST validate endpoint verifies token against GitHub and returns validity plus account login\\n- [ ] GET settings redacts PAT values while preserving indication that a token exists\\n- [ ] Validation and save failures show actionable error messages",
          "status": "review",
          "position": 0
        },
        {
          "id": "Wj_wjBAE-8nB",
          "title": "As a project owner, I want GitHub remote auto-detection so that I can connect owner and repo in one click",
          "description": "Detect owner and repo from git origin URL for projects with a local repository. Show a connect banner and patch project metadata when accepted.",
          "acceptance_criteria": "- [ ] Detect endpoint parses SSH and HTTPS remote formats into owner and repo\\n- [ ] Banner appears only when project has gitRepoPath and missing githubOwnerRepo\\n- [ ] Connect action stores githubOwnerRepo on project\\n- [ ] Dismiss action hides the banner without mutating repository metadata",
          "status": "review",
          "position": 1
        },
        {
          "id": "ovCeDQ0UO5qR",
          "title": "As a developer, I want push, pull, fetch, and branch status endpoints so that I can sync local branches safely",
          "description": "Implement git sync APIs using simple-git with explicit error handling and ff-only pull behavior. Return ahead or behind counters for branch-level status.",
          "acceptance_criteria": "- [ ] Endpoints exist for push, pull, fetch, and status and return structured data payloads\\n- [ ] Pull uses ff-only semantics and returns explicit conflict guidance when not possible\\n- [ ] Status endpoint returns ahead and behind values for requested branch\\n- [ ] All sync actions include project and branch context in API responses",
          "status": "review",
          "position": 2
        },
        {
          "id": "jGZU8SuIiOVF",
          "title": "As an operator, I want every remote operation logged so that sync failures are auditable and debuggable",
          "description": "Create a dedicated git sync log table and utility to capture operation type, status, branch, and details for all GitHub-related operations.",
          "acceptance_criteria": "- [ ] `gitSyncLog` table exists with operation, status, detail, and timestamps\\n- [ ] Push, pull, fetch, and detect workflows write success and failure entries\\n- [ ] Log entries include projectId and optional branch context\\n- [ ] Failure logs include machine-readable detail payloads",
          "status": "review",
          "position": 3
        }
      ]
    },
    {
      "id": "PLfVTmLsLqCr",
      "title": "Unified Chat & Epic Creation Side Panel",
      "description": "Rework the separate chat panel and epic creation flow into a single unified side panel component. The panel lives on the right side of the screen, collapsed by default (showing ~5% as a grayed-out edge). Clicking 'Chat' or 'New Epic' expands the panel, splitting the screen into a resizable two-pane layout (board + chat). The panel supports tabbed conversations with agent activity indicators and mandatory agent type selection on each new chat.\n\n## Implementation Plan\n\n### Phase 1 — Unified Panel Shell\n- Create a `UnifiedChatPanel` component that replaces the current separate chat panel and epic creation chat\n- Panel has three visual states: collapsed (5% visible, grayed overlay on the right edge), expanded (resizable split with the board), and hidden (0%)\n- Default state is collapsed — a thin vertical strip visible on the right side\n- Clicking the collapsed strip or toolbar buttons ('Chat', 'New Epic') transitions to expanded state\n- Use a resizable split layout (e.g. `react-resizable-panels` or custom CSS resize) so the user can drag the divider between the board and the chat panel\n- Persist the panel width in local state (or localStorage) so it remembers the user's preferred split\n\n### Phase 2 — Tabbed Conversations\n- The panel supports multiple open conversations as tabs (similar to browser tabs)\n- Each tab represents a chat conversation (brainstorm, epic creation, or general)\n- Tabs show the conversation title (truncated) and a close button\n- A '+' button creates a new tab\n- Active tab is visually highlighted\n- Tab state persisted in the existing `chatMessages` / `chatConversations` DB tables\n\n### Phase 3 — Agent Activity Indicator in Tabs\n- When an agent is actively working on a conversation (streaming response, building, etc.), display a small animated icon (spinner or pulsing dot) on the corresponding tab\n- The indicator is visible even when the panel is collapsed, appearing on the thin right-edge strip as a subtle glow or badge\n- Poll agent session status to determine which conversations have active agents\n\n### Phase 4 — Agent Type Selector on New Chat\n- When creating a new conversation ('+' tab or 'New Epic' / 'Chat' trigger), show a mandatory agent type selector before the first message\n- Agent types: 'Brainstorm' (plan mode), 'Epic Creation' (spec generation mode), or custom types from agent config\n- The selected type determines the prompt builder and Claude Code mode used\n- Selector displayed as a prominent dropdown or button group at the top of the empty chat\n- Once the first message is sent, the agent type is locked for that conversation\n\n### Phase 5 — Board Integration\n- Remove the old chat panel toggle from the project header\n- The kanban board occupies 100% width when the panel is collapsed\n- When expanded, the board flexes to fill the remaining space\n- 'New Epic' button in the board toolbar opens the panel with a new 'Epic Creation' tab pre-selected\n- 'Chat' button opens the panel with a new 'Brainstorm' tab or focuses the last active tab\n- Ensure the kanban board remains fully functional (drag-and-drop, selection, build toolbar) in the reduced width",
      "priority": 2,
      "status": "done",
      "position": 23,
      "branchName": null,
      "user_stories": [
        {
          "id": "Lna7Crqsq1_n",
          "title": "As a user, I want a collapsed chat strip on the right edge of the screen so that I know the chat panel exists without it taking up space",
          "description": "Create the unified panel shell with a collapsed state showing approximately 5% of the screen width as a grayed-out vertical strip on the right side. The strip should have a subtle visual cue (e.g. a chat icon or vertical text) indicating it can be expanded. Clicking anywhere on the strip expands the panel.",
          "acceptance_criteria": "- [ ] Collapsed panel renders as a thin vertical strip (~5% width) on the right edge\n- [ ] Strip has a muted/grayed appearance distinct from the main content\n- [ ] Subtle visual indicator (icon or label) on the strip hints at chat functionality\n- [ ] Clicking the strip transitions the panel to the expanded state\n- [ ] Panel defaults to collapsed state on page load\n- [ ] Smooth CSS transition between collapsed and expanded states",
          "status": "review",
          "position": 0
        },
        {
          "id": "F5Scy6DPVLAN",
          "title": "As a user, I want a resizable split layout between the kanban board and the chat panel so that I can adjust the space allocated to each",
          "description": "When the chat panel is expanded, the screen splits into two resizable panes: the kanban board on the left and the chat panel on the right. A draggable divider allows resizing. The board and panel each have a minimum width to remain usable. The user's preferred width ratio persists across sessions via localStorage.",
          "acceptance_criteria": "- [ ] Expanded panel creates a horizontal split layout with board (left) and chat (right)\n- [ ] Draggable divider between the two panes allows resizing\n- [ ] Minimum width constraint on both panes (e.g. 300px each) to prevent collapsing\n- [ ] Default split ratio is approximately 60% board / 40% chat\n- [ ] Split ratio persisted in localStorage and restored on next visit\n- [ ] Kanban board remains fully functional (DnD, selection, toolbar) in reduced width\n- [ ] Double-clicking the divider resets to default ratio",
          "status": "review",
          "position": 1
        },
        {
          "id": "1FZVFa5_0XVK",
          "title": "As a user, I want tabbed conversations in the chat panel so that I can have multiple chats open simultaneously",
          "description": "The chat panel displays a tab bar at the top with one tab per open conversation. Each tab shows a truncated title and a close button. A '+' button at the end of the tab bar creates a new conversation. The active tab is highlighted. Switching tabs loads the corresponding conversation history.",
          "acceptance_criteria": "- [ ] Tab bar rendered at the top of the chat panel\n- [ ] Each tab shows conversation title (truncated to ~20 chars) and close (X) button\n- [ ] '+' button at the end of the tab bar creates a new conversation\n- [ ] Active tab visually highlighted with distinct background/border\n- [ ] Clicking a tab switches to that conversation and loads its message history\n- [ ] Closing a tab removes it from the bar (conversation persists in DB)\n- [ ] At least one tab always remains open (last tab cannot be closed)\n- [ ] Tab order matches creation order, newest on the right",
          "status": "review",
          "position": 2
        },
        {
          "id": "6RV-cqMOUEAK",
          "title": "As a user, I want an animated indicator on tabs when an agent is working so that I can see which conversations have active agents",
          "description": "When a Claude Code agent is actively processing a response for a conversation (streaming, building, reviewing), display a small animated indicator (spinning icon or pulsing dot) on that conversation's tab. The indicator is visible both in expanded and collapsed panel states. In collapsed state, show a subtle badge or glow on the right-edge strip.",
          "acceptance_criteria": "- [ ] Animated spinner or pulsing dot appears on tabs with active agent sessions\n- [ ] Indicator polls agent session status at regular intervals (e.g. every 3 seconds)\n- [ ] Indicator disappears when the agent session completes, fails, or is cancelled\n- [ ] Multiple tabs can show indicators simultaneously\n- [ ] In collapsed panel state, a badge/glow on the strip indicates active agents\n- [ ] Indicator is visually distinct from static tab elements (color and animation)",
          "status": "review",
          "position": 3
        },
        {
          "id": "Nu7AhjWRevWM",
          "title": "As a user, I want to select the agent type when creating a new chat so that each conversation uses the appropriate Claude Code mode",
          "description": "When a new conversation tab is created, show a mandatory agent type selector before allowing the first message. Options include 'Brainstorm' (plan mode), 'Epic Creation' (spec generation), and any custom agent types from agent config. The selector is displayed as a button group or dropdown at the top of the empty chat. Once the first message is sent, the agent type is locked and displayed as a badge in the tab.",
          "acceptance_criteria": "- [ ] New conversation shows agent type selector before first message\n- [ ] Available types: 'Brainstorm', 'Epic Creation', plus custom types from agent config\n- [ ] Selector rendered as a prominent button group or dropdown in the empty chat area\n- [ ] First message cannot be sent until an agent type is selected\n- [ ] Selected type stored in the conversation record in the database\n- [ ] After first message, agent type is locked and selector becomes a read-only badge\n- [ ] Agent type badge displayed in the tab alongside the title\n- [ ] Agent type determines the prompt builder and Claude Code mode used",
          "status": "review",
          "position": 4
        },
        {
          "id": "ewewm47pu8Gj",
          "title": "As a user, I want the 'Chat' and 'New Epic' buttons to open the unified panel so that all chat interactions happen in one place",
          "description": "Replace the existing separate chat panel toggle and epic creation flow with actions that open the unified side panel. 'Chat' button in the project toolbar expands the panel and focuses the last active brainstorm tab (or creates a new one). 'New Epic' button expands the panel and creates a new tab with 'Epic Creation' agent type pre-selected. Remove the old standalone chat panel component and epic creation modal/route.",
          "acceptance_criteria": "- [ ] 'Chat' button in project toolbar expands the unified panel\n- [ ] 'Chat' focuses the last active brainstorm tab or creates a new one if none exists\n- [ ] 'New Epic' button expands the panel and creates a new tab with 'Epic Creation' pre-selected\n- [ ] Old standalone chat panel component removed\n- [ ] Old epic creation modal/route replaced by the new panel flow\n- [ ] Panel can be collapsed back via a close/collapse button or clicking outside\n- [ ] Keyboard shortcut (e.g. Escape) collapses the panel",
          "status": "review",
          "position": 5
        }
      ]
    },
    {
      "id": "HMaIVdFQ0UQL",
      "title": "Pull Request Workflow from Epics",
      "description": "Enable push-and-create PR flow from epic context with generated PR descriptions and synchronized PR status.",
      "priority": 2,
      "status": "done",
      "position": 24,
      "branchName": "feature/epic-HMaIVdFQ0UQL-pull-request-workflow-from-epics",
      "user_stories": [
        {
          "id": "iLlXl8YtEPVi",
          "title": "As a developer, I want PR metadata persisted in epics and dedicated PR records so that PR tracking is first-class",
          "description": "Extend schema with epic PR fields and a `pull_requests` table linked to projects and epics.",
          "acceptance_criteria": "- [ ] `epics` table includes `prNumber`, `prUrl`, and `prStatus`\n- [ ] `pull_requests` table is added with project/epic linkage and GitHub metadata\n- [ ] Migrations run without data loss and are reversible in development\n- [ ] Type-safe models are updated for new fields",
          "status": "todo",
          "position": 0
        },
        {
          "id": "IUB1GX0eyiwO",
          "title": "As a product user, I want a backend endpoint to push and create PR so that I can open PRs directly from Arij",
          "description": "Implement PR route handlers that push branch, create PR via Octokit, and sync status back into local records.",
          "acceptance_criteria": "- [ ] `POST /api/projects/[projectId]/epics/[epicId]/pr` pushes the branch and creates PR through Octokit\n- [ ] PR body is generated from epic description and story checklist content\n- [ ] `GET /api/projects/[projectId]/epics/[epicId]/pr` syncs current GitHub PR status back to local DB\n- [ ] PR create/sync operations are recorded in `git_sync_log`",
          "status": "todo",
          "position": 1
        },
        {
          "id": "OaFY1jQeiIvd",
          "title": "As a product user, I want PR controls and status in epic detail so that I can manage PR lifecycle from one place",
          "description": "Show create button before PR exists and status badge/link/sync controls afterward, with proper disabled states.",
          "acceptance_criteria": "- [ ] Epic detail shows `Push and Create PR` when no PR exists\n- [ ] After creation, detail shows PR number, status badge, GitHub link, and sync action\n- [ ] Controls are disabled while requests are running or when task lock is active\n- [ ] Errors include remediation hints for missing branch, missing token, or GitHub API failure",
          "status": "todo",
          "position": 2
        },
        {
          "id": "R155mOX4Gvhm",
          "title": "As a product user, I want PR visibility on epic cards so that I can scan PR state from the board",
          "description": "Add compact PR badge/icon rendering in kanban card headers with status-aware styles and direct link behavior.",
          "acceptance_criteria": "- [ ] Epic cards show a PR icon and number when `prNumber` is present\n- [ ] Badge style reflects status (`open`, `draft`, `closed`, `merged`)\n- [ ] Clicking badge opens the PR URL in a new tab",
          "status": "todo",
          "position": 3
        }
      ]
    },
    {
      "id": "uU4p42bLNWzo",
      "title": "Unified Chat and Epic Creation Workspace",
      "description": "Fuse New Epic creation and chat into a single right-side workspace that can be partially collapsed, expanded on demand, and resized against the kanban board. Ensure each new chat tab preserves explicit agent type selection.",
      "priority": 1,
      "status": "done",
      "position": 25,
      "branchName": "feature/epic-uU4p42bLNWzo-unified-chat-and-epic-creation-workspace",
      "user_stories": [
        {
          "id": "ZhXPgacV0mg3",
          "title": "As a product manager, I want New Epic and Chat merged into one panel so that ideation and discussion happen in a single workflow",
          "description": "Replace separate New Epic modal or sheet with creation-specific chat tabs in the unified panel.",
          "acceptance_criteria": "- [ ] Clicking New Epic opens chat panel with a new epic-creation tab\\n- [ ] Normal Chat opens standard conversation tab in same panel\\n- [ ] Legacy CreateEpic sheet or modal entry points are removed\\n- [ ] Epic creation route uses the same message stream endpoint with conversation type routing",
          "status": "todo",
          "position": 0
        },
        {
          "id": "gP1rF7rqCIYT",
          "title": "As a user, I want the chat workspace collapsed on the right by default so that board space is preserved until needed",
          "description": "Implement right-edge collapsed state with a visible sliver and open behavior from chat actions.",
          "acceptance_criteria": "- [ ] Default state shows a subtle right-side collapsed rail segment\\n- [ ] Chat and New Epic actions expand the panel reliably\\n- [ ] Panel can be collapsed again without losing current tabs\\n- [ ] Collapsed and expanded states are visually distinct and accessible",
          "status": "todo",
          "position": 1
        },
        {
          "id": "p4NRabThQZ6U",
          "title": "As a user, I want a resizable split between board and chat so that I can adapt layout to my current task",
          "description": "Introduce adjustable pane ratio with sensible minimum widths for both board and chat.",
          "acceptance_criteria": "- [ ] Board and chat render side by side in expanded state\\n- [ ] User can drag splitter to resize panel widths\\n- [ ] Minimum widths prevent either pane from becoming unusable\\n- [ ] Layout works on desktop and degrades safely on narrower screens",
          "status": "todo",
          "position": 2
        },
        {
          "id": "fDxgJIxx1Njd",
          "title": "As a user, I want agent type selection pre-populated on every new chat tab so that runs start with explicit provider choice",
          "description": "Ensure each new tab, including epic-creation tabs, initializes with current agent type defaults and allows per-tab changes.",
          "acceptance_criteria": "- [ ] New chat tabs initialize with selected agent type\\n- [ ] New epic-creation tabs also initialize with selected agent type\\n- [ ] Changing agent type in one tab does not corrupt existing run metadata in other tabs\\n- [ ] Agent type state persists during panel collapse and expand transitions",
          "status": "todo",
          "position": 3
        },
        {
          "id": "C4HydnBOQxBE",
          "title": "As a user, I want running indicators on chat tabs so that active agent work is visible immediately",
          "description": "Show tab-level activity icon when an agent is executing in that conversation.",
          "acceptance_criteria": "- [ ] Running tab shows activity icon while agent session is active\\n- [ ] Icon clears automatically when session ends\\n- [ ] Indicator state updates without manual refresh\\n- [ ] Tab labels remain readable with indicator present",
          "status": "todo",
          "position": 4
        }
      ]
    },
    {
      "id": "LiSlsRifJqo-",
      "title": "Unified Chat and Epic Creation Split Workspace",
      "description": "Fuse New Epic into the chat system and move to a right-docked, resizable split layout where board and chat coexist. Preserve strong context controls including agent type per tab.",
      "priority": 2,
      "status": "done",
      "position": 26,
      "branchName": "feature/epic-LiSlsRifJqo--unified-chat-and-epic-creation-split-wor",
      "user_stories": [
        {
          "id": "hsBcMrOWMgM9",
          "title": "As a product user, I want a collapsed right-side chat rail so that the board stays focused while chat remains quickly accessible",
          "description": "Implement a default collapsed panel with a visible grey sliver and expand/collapse interactions from header actions.",
          "acceptance_criteria": "- [ ] The right-side chat panel is collapsed by default and leaves an always-visible grey rail near 5% of viewport width\n- [ ] Clicking `Chat` or `New Epic` expands the panel\n- [ ] Users can manually collapse the panel again\n- [ ] Expanded/collapsed state persists per project and reload",
          "status": "todo",
          "position": 0
        },
        {
          "id": "rtq_iadUW0w3",
          "title": "As a product user, I want New Epic fused with chat tabs so that epic ideation and creation happen in one place",
          "description": "Remove separate New Epic modal and open `epic_creation` chat tabs that use epic-specific prompting and in-panel create action.",
          "acceptance_criteria": "- [ ] `New Epic` no longer opens a separate modal and instead opens a new `epic_creation` chat tab\n- [ ] Chat streaming route selects epic-creation prompt logic when conversation type is `epic_creation`\n- [ ] The epic creation tab exposes `Create Epic and Generate Stories` action inside the panel\n- [ ] On success, board data refreshes and the created epic is selectable from kanban",
          "status": "todo",
          "position": 1
        },
        {
          "id": "RCBX0i7SMehp",
          "title": "As a product user, I want board and chat in a resizable split so that I can choose the best work context",
          "description": "Add a draggable divider with bounds and persisted width for desktop, plus robust mobile fallback behavior.",
          "acceptance_criteria": "- [ ] Board and chat panel render in a two-pane layout when panel is expanded\n- [ ] Divider is draggable with min/max widths to prevent unusable layout\n- [ ] Pane width is persisted and restored on reload\n- [ ] On mobile, panel falls back to full-screen drawer behavior without breaking board actions",
          "status": "todo",
          "position": 2
        },
        {
          "id": "lpkCJCiECTNv",
          "title": "As a product user, I want agent type selection present on every new chat so that execution context is explicit",
          "description": "Ensure newly created chat tabs always include an initialized agent type selector and persist this value at conversation level.",
          "acceptance_criteria": "- [ ] Agent type selector is visible on every newly created chat tab, including `epic_creation`\n- [ ] New tabs initialize with configured default agent type\n- [ ] Changing agent type updates only the active tab unless user explicitly changes global default\n- [ ] Selected agent type is saved in conversation metadata and used for execution",
          "status": "todo",
          "position": 3
        }
      ]
    },
    {
      "id": "YthO7n3qW2Bm",
      "title": "Agent Concurrency Guards and Work Feedback",
      "description": "Prevent launching overlapping agents on the same task and expose clear lock/running feedback across board, detail views, and chat tabs.",
      "priority": 3,
      "status": "done",
      "position": 27,
      "branchName": null,
      "user_stories": [
        {
          "id": "so4RZBYfyrwY",
          "title": "As a product user, I want backend checks that block starting another agent on the same task so that duplicate work cannot run in parallel",
          "description": "Add task-level conflict checks to all agent launch endpoints, not only build, and return consistent conflict payloads.",
          "acceptance_criteria": "- [ ] All agent launch endpoints check for an active running session on the same target task before dispatch\n- [ ] Conflicts return HTTP 409 with code `AGENT_ALREADY_RUNNING` and include active session id metadata\n- [ ] Concurrent double-submit attempts create at most one active session\n- [ ] Locks are released automatically when sessions enter terminal states",
          "status": "review",
          "position": 0
        },
        {
          "id": "vEjvtFcFMAm_",
          "title": "As a product user, I want locked actions greyed out so that I do not accidentally trigger forbidden operations",
          "description": "Wire lock state to action buttons on epic and story surfaces with non-interactive disabled behavior.",
          "acceptance_criteria": "- [ ] Agent-triggering buttons on locked epic/story targets are visually greyed and disabled\n- [ ] Disabled controls are non-interactive via mouse and keyboard\n- [ ] A tooltip or helper text explains that another agent is already running on this task\n- [ ] Local loading states and lock states are merged so UI cannot flicker enabled/disabled incorrectly",
          "status": "review",
          "position": 1
        },
        {
          "id": "WnRgNGr2vr-e",
          "title": "As a product user, I want running indicators in cards and tabs so that I can see active work instantly",
          "description": "Show real-time running status in kanban cards and unified chat tabs and provide navigation to active sessions from conflicts.",
          "acceptance_criteria": "- [ ] Kanban epic cards display a running indicator when any session is active for that epic\n- [ ] Unified chat tabs show a running icon while their linked session is active\n- [ ] Indicator state updates within one polling interval after session start/stop\n- [ ] Conflict toast includes a link or shortcut to open the active session",
          "status": "review",
          "position": 2
        }
      ]
    },
    {
      "id": "eBiIVHhxzP4z",
      "title": "Git Sync Feedback and Agent Concurrency Guardrails",
      "description": "Provide clear in-product feedback for active agent work and prevent duplicate execution on the same epic or story. This epic combines UI lockouts with strict backend conflict checks.",
      "priority": 3,
      "status": "done",
      "position": 28,
      "branchName": null,
      "user_stories": [
        {
          "id": "hbA5sP7xzHbr",
          "title": "As a developer, I want ahead and behind badges in epic details so that I know when to push or pull",
          "description": "Display Git sync status for epic branches with refresh and push controls where GitHub is configured.",
          "acceptance_criteria": "- [ ] Epic detail shows ahead and behind counters when branch exists and GitHub is configured\\n- [ ] Push button triggers remote push endpoint and refreshes status after completion\\n- [ ] Loading and error states are displayed inline without breaking panel layout\\n- [ ] Git sync section is hidden when GitHub is not configured",
          "status": "todo",
          "position": 0
        },
        {
          "id": "ljND2PgCD4wi",
          "title": "As a user, I want actions greyed out when an agent is already running on the same task so that I cannot launch duplicate runs",
          "description": "Disable conflicting actions across epic, story, and chat contexts while an active session targets the same entity.",
          "acceptance_criteria": "- [ ] Build, review, and story execution actions are disabled for entities with active sessions\\n- [ ] Disabled controls include a tooltip or label explaining why the action is blocked\\n- [ ] Controls re-enable automatically after session completion or failure\\n- [ ] Non-conflicting actions on other entities remain available",
          "status": "todo",
          "position": 1
        },
        {
          "id": "QPGIdh8iozoq",
          "title": "As a platform engineer, I want server-side duplicate-run protection so that bypassing the UI cannot start parallel conflicting agents",
          "description": "Add session lock checks to relevant endpoints and return deterministic conflict responses containing the running session reference.",
          "acceptance_criteria": "- [ ] Build, review, and story-related execution endpoints check for active sessions on target entity\\n- [ ] Conflicting attempts return HTTP 409 with running session id and task context\\n- [ ] Locking logic is centralized in reusable server utility code\\n- [ ] Existing successful flows remain unaffected when no lock exists",
          "status": "todo",
          "position": 2
        },
        {
          "id": "Ey1a9YAvbX3a",
          "title": "As a product manager, I want active-work indicators on cards and tabs so that I can see running agents without opening details",
          "description": "Show a compact activity icon on epic cards and chat tabs when an agent is running for that scope.",
          "acceptance_criteria": "- [ ] Epic card displays running indicator when associated session is active\\n- [ ] Chat tabs display running indicator while tab session is active\\n- [ ] Indicators update on polling cycles without full-page reload\\n- [ ] Indicator styling is visible but does not break dense kanban layouts",
          "status": "todo",
          "position": 3
        }
      ]
    },
    {
      "id": "YiedZi_VETKe",
      "title": "Agent Busy Guards & Visual Feedback",
      "description": "Prevent overlapping agent actions on epics and stories by enforcing busy guards across all action types, and provide clear visual feedback on kanban cards and story views when an agent is actively working.\n\n## Implementation Plan\n\n### Phase 1 — Unified Agent Busy State Detection\n- Create a shared utility/hook `useAgentBusyState(entityId, entityType)` that checks whether any agent session (build, review, chat) is currently running for a given epic or story\n- Query the `agentSessions` table for running sessions linked to the entity\n- Return `{ isBusy, sessionType, sessionId }` so the UI knows what kind of work is happening\n- This replaces the scattered `isRunning` checks with a single source of truth\n\n### Phase 2 — Backend Concurrency Guards\n- Add a generic `checkActiveSession(entityId, entityType)` helper in the API layer\n- Apply it to ALL agent dispatch endpoints: build, review, send-to-dev, team build, chat\n- Return HTTP 409 Conflict with a descriptive message when an agent is already working on the entity\n- Ensure the guard checks both epic-level and story-level sessions (e.g., a story build blocks epic-level actions on the same epic's worktree)\n\n### Phase 3 — Kanban Card Busy Indicators\n- Add a visual indicator (spinner, pulsing dot, or animated border) on kanban epic cards when an agent is actively working\n- Show the type of work in progress (e.g., 'Building...', 'Reviewing...') as a small badge on the card\n- The indicator should be visible without opening the epic detail panel\n- Poll or use existing session polling to keep the indicator in sync\n\n### Phase 4 — Greyed-Out Actions in Epic & Story Views\n- In `EpicActions`, disable ALL agent action buttons (Build, Review, Send to Dev) when any agent session is active for the epic — not just the same action type\n- In `StoryActions` and `UserStoryQuickActions`, disable agent action buttons when a session is running for that story or its parent epic's worktree\n- Show a tooltip on disabled buttons explaining why (e.g., 'Agent is currently building this epic')\n- Replace loading-only disabled state with session-aware disabled state\n\n### Phase 5 — Review Endpoint Concurrency Check\n- The review endpoint currently lacks the same concurrency guard as the build endpoint\n- Add `checkActiveSession` to the review dispatch route\n- Prevent launching multiple overlapping review agents for the same story\n- Allow multiple different review types to run in parallel (security + code review) but prevent duplicate types",
      "priority": 2,
      "status": "done",
      "position": 29,
      "branchName": null,
      "user_stories": [
        {
          "id": "6IIR0Y2OaC0l",
          "title": "As a user, I want a unified hook to detect agent busy state so that all UI components share a single source of truth for running sessions",
          "description": "Create a `useAgentBusyState(entityId, entityType)` hook that queries agent sessions and returns whether any session is active for the given entity. The hook should support both epic and story entity types, return the session type (build/review/chat), and poll at regular intervals.",
          "acceptance_criteria": "- [ ] `useAgentBusyState` hook created in `hooks/` directory\n- [ ] Accepts `entityId` and `entityType` ('epic' | 'story') parameters\n- [ ] Returns `{ isBusy: boolean, sessionType: string | null, sessionId: string | null }`\n- [ ] Queries running agent sessions linked to the entity\n- [ ] Polls at configurable interval (default 3 seconds)\n- [ ] Handles both epic-level and story-level sessions\n- [ ] Replaces scattered `isRunning` checks in existing components",
          "status": "review",
          "position": 0
        },
        {
          "id": "-CiJ6ysfWvDF",
          "title": "As a user, I want all agent dispatch endpoints to check for active sessions so that overlapping agents cannot be launched on the same entity",
          "description": "Create a `checkActiveSession(entityId, entityType)` helper function and apply it to all agent dispatch API routes: build, review, send-to-dev, team build. Return HTTP 409 Conflict with a descriptive error message when an agent is already working. Ensure cross-entity awareness (e.g., a story build blocks actions on the parent epic's worktree).",
          "acceptance_criteria": "- [ ] `checkActiveSession` helper created in `lib/claude/` or `lib/utils/`\n- [ ] Applied to `POST .../build` (batch build route)\n- [ ] Applied to `POST .../stories/[storyId]/build` (send-to-dev route)\n- [ ] Applied to `POST .../stories/[storyId]/review` (review route)\n- [ ] Returns HTTP 409 with `{ error: 'Agent already active on this entity' }` when busy\n- [ ] Story-level builds block epic-level actions on the same epic's worktree\n- [ ] Epic-level builds block story-level actions for stories in that epic\n- [ ] Error message includes the type of active session for debugging",
          "status": "review",
          "position": 1
        },
        {
          "id": "wjSKHRf19ZaG",
          "title": "As a user, I want to see a visual indicator on kanban cards when an agent is working so that I know the epic's status at a glance",
          "description": "Add a visual busy indicator (animated spinner, pulsing dot, or glowing border) on kanban epic cards when an agent session is active for that epic. Display the work type as a small badge (e.g., 'Building...', 'Reviewing...'). The indicator should be visible without opening the epic detail panel and update via polling.",
          "acceptance_criteria": "- [ ] Animated indicator (spinner or pulsing dot) displayed on epic cards with active agent sessions\n- [ ] Work type badge shown on the card (e.g., 'Building...', 'Reviewing...', 'Sending to dev...')\n- [ ] Indicator visible on the kanban board without opening the epic detail\n- [ ] Indicator updates in real-time via existing session polling\n- [ ] Indicator disappears when the session completes, fails, or is cancelled\n- [ ] Multiple active sessions on different epics show indicators on each card\n- [ ] Consistent styling with existing UI (dark mode, shadcn/ui)",
          "status": "review",
          "position": 2
        },
        {
          "id": "-wl_MgfbGweq",
          "title": "As a user, I want all agent action buttons greyed out when an agent is active so that I cannot accidentally launch overlapping agents",
          "description": "Update `EpicActions`, `StoryActions`, and `UserStoryQuickActions` components to disable all agent action buttons when any agent session is running for the entity. Use the `useAgentBusyState` hook instead of local loading state. Show a tooltip on disabled buttons explaining the reason (e.g., 'Agent is currently building this epic').",
          "acceptance_criteria": "- [ ] `EpicActions` disables Build, Review, and Send to Dev buttons when any session is active for the epic\n- [ ] `StoryActions` disables all agent buttons when a session is running for the story or its parent epic\n- [ ] `UserStoryQuickActions` disables agent icons when a session is running\n- [ ] Disabled buttons show a tooltip explaining why (e.g., 'Agent is currently building this epic')\n- [ ] Uses `useAgentBusyState` hook instead of local `isRunning` / `isLoading` state\n- [ ] Buttons re-enable automatically when the session completes\n- [ ] Non-agent actions (edit, delete, status change) remain enabled",
          "status": "review",
          "position": 3
        },
        {
          "id": "L8Iti5hrqo57",
          "title": "As a user, I want the review endpoint to prevent duplicate review agents so that I cannot accidentally launch the same review type twice",
          "description": "Add concurrency checks to the review dispatch route. Prevent launching a review agent when a review of the same type is already running for the story. Allow different review types to run in parallel (e.g., security + code review simultaneously). Return a clear error message identifying which review type is already running.",
          "acceptance_criteria": "- [ ] Review endpoint checks for active review sessions before dispatching\n- [ ] Duplicate review type for the same story is rejected with HTTP 409\n- [ ] Different review types can run in parallel (e.g., security + code review)\n- [ ] Error message specifies which review type is already running\n- [ ] Custom review agents also checked for duplicates\n- [ ] Existing review sessions that have completed or failed do not block new reviews",
          "status": "review",
          "position": 4
        }
      ]
    },
    {
      "id": "joNsPcIP6FFP",
      "title": "GitHub Remote Foundation",
      "description": "Introduce project-level GitHub configuration, token validation, remote detection, core remote git routes, and audit logging while preserving local-only workflows.",
      "priority": 3,
      "status": "done",
      "position": 30,
      "branchName": null,
      "user_stories": [
        {
          "id": "aLVOkjaCuSJs",
          "title": "As a project owner, I want GitHub PAT configuration and validation so that API-based GitHub operations are secure and reliable",
          "description": "Add settings UI and API for PAT validation and enforce redaction in all settings reads.",
          "acceptance_criteria": "- [ ] Settings page includes a GitHub PAT section with masked value, validate action, and save action\n- [ ] `POST /api/settings/github/validate` returns `valid` and GitHub login on success\n- [ ] `GET /api/settings` never returns the raw PAT and only returns a redacted mask\n- [ ] Token read/write paths are covered by tests for invalid token and missing token cases",
          "status": "todo",
          "position": 0
        },
        {
          "id": "_WteDpt9nI81",
          "title": "As a project owner, I want remote detection and one-click connection so that enabling GitHub per project is fast",
          "description": "Auto-detect GitHub origin from local git remotes and let users persist `githubOwnerRepo` directly from a contextual banner.",
          "acceptance_criteria": "- [ ] `POST /api/projects/[projectId]/git/detect-remote` parses `origin` and returns detected `owner/repo` when present\n- [ ] Projects with git repo path and missing `githubOwnerRepo` show a connect banner\n- [ ] Clicking connect persists `githubOwnerRepo` on the project\n- [ ] Dismiss state prevents repeated prompts in the same project context",
          "status": "todo",
          "position": 1
        },
        {
          "id": "n0-fSPElG6Ez",
          "title": "As a developer, I want push/pull/fetch/status API routes so that remote synchronization can be done from Arij",
          "description": "Create git remote routes backed by `simple-git` with consistent request validation and error contracts.",
          "acceptance_criteria": "- [ ] `push`, `pull`, `fetch`, and `status` routes are implemented and validated for required parameters\n- [ ] Pull uses fast-forward-only behavior and returns explicit conflict/non-ff errors\n- [ ] Status endpoint returns ahead/behind counts for a requested branch\n- [ ] Routes fail with clear `not_configured` errors when GitHub integration is absent",
          "status": "todo",
          "position": 2
        },
        {
          "id": "AqECg-dxu69i",
          "title": "As an operator, I want remote operations journaled so that debugging and auditability are straightforward",
          "description": "Add `git_sync_log` persistence for all remote actions and expose a retrieval path for project troubleshooting.",
          "acceptance_criteria": "- [ ] `git_sync_log` table records operation, branch, status, detail, and timestamp per remote action\n- [ ] Push/pull/fetch/tag/pr/release operations all write success/failure audit entries\n- [ ] Failure logs include sanitized error payloads sufficient for troubleshooting\n- [ ] A project-level query path exists to retrieve recent sync log rows",
          "status": "todo",
          "position": 3
        }
      ]
    },
    {
      "id": "RkXw-_aEGx0K",
      "title": "Fuse New Epic into Chat Panel",
      "description": "Remove the standalone 'New Epic' modal/flow and instead open epic creation as a new tab in the existing UnifiedChatPanel. When the user clicks 'New Epic', the chat panel opens with a new tab of type `epic_creation`. The chat stream API route checks the conversation type and uses the epic refinement prompt for `epic_creation` conversations. After the brainstorming chat converges, a 'Create Epic & Generate Stories' button triggers epic + user story creation from the conversation context.\n\n## Implementation Plan\n\n### Step 1 — Server-side routing in /api/chat/stream\n- Modify the chat stream endpoint to check the conversation's `type` field\n- When type is `epic_creation`, use the epic refinement prompt builder (existing `buildSpecPrompt` or a new `buildEpicCreationPrompt`) instead of the default brainstorm prompt\n- Ensure the prompt includes project context (spec, documents) and instructs Claude to help the user define an epic with user stories\n\n### Step 2 — New useEpicCreate hook\n- Create a small React hook (`useEpicCreate`) that takes the conversation context and calls the API to create an epic with generated user stories\n- The hook calls `POST /api/projects/[projectId]/epics` with the epic data extracted from the conversation\n- Returns loading/error/success states\n\n### Step 3 — UnifiedChatPanel UI updates\n- Add a 'Create Epic & Generate Stories' button that appears in `epic_creation` conversations once enough context has been discussed\n- Differentiate tab icons: sparkles icon for `epic_creation` tabs vs message icon for regular chat tabs\n- Add an empty-state hint in new `epic_creation` tabs explaining what the user can do\n- Wire `onEpicCreated` callback to refresh the kanban board and optionally close the tab\n\n### Step 4 — MessageInput placeholder\n- Add a `placeholder` prop to the MessageInput component\n- Set context-aware placeholder text: 'Describe your epic idea...' for epic_creation tabs, 'Ask a question...' for brainstorm tabs\n\n### Step 5 — Rewire page.tsx\n- Point the 'New Epic' button in the project page to `panelRef.current?.openNewEpic()` which creates a new `epic_creation` tab\n- Remove the old modal/sheet import and rendering\n\n### Step 6 — Delete dead code\n- Remove `CreateEpicSheet.tsx` component\n- Remove `useEpicCreation.ts` hook\n- Clean up any unused imports",
      "priority": 2,
      "status": "done",
      "position": 31,
      "branchName": null,
      "user_stories": [
        {
          "id": "lt-A7OoL8MEH",
          "title": "As a user, I want the chat stream API to use the epic refinement prompt for epic_creation conversations so that Claude guides me through epic definition",
          "description": "Modify `/api/chat/stream` (or the relevant chat API route) to check the conversation's `type` field. When the type is `epic_creation`, compose the prompt using the epic refinement/spec prompt builder instead of the default brainstorm prompt. The prompt should include project context (spec, documents, existing epics) and instruct Claude to help the user define a well-structured epic with user stories and acceptance criteria.",
          "acceptance_criteria": "- [ ] Chat stream route reads conversation `type` from DB or request\n- [ ] When type is `epic_creation`, epic refinement prompt builder is used\n- [ ] Epic refinement prompt includes project spec, documents, and existing epic titles for context\n- [ ] Prompt instructs Claude to guide the user through epic definition (title, description, user stories, acceptance criteria)\n- [ ] Default brainstorm prompt still used for non-epic_creation conversations\n- [ ] No breaking changes to existing chat functionality",
          "status": "todo",
          "position": 0
        },
        {
          "id": "IxpuH3fzMjG_",
          "title": "As a user, I want a useEpicCreate hook so that epic creation from conversation context is handled cleanly",
          "description": "Create a `useEpicCreate` React hook that takes the conversation ID and project ID, calls the API to create an epic with user stories derived from the conversation, and returns loading/error/success states. The hook calls `POST /api/projects/[projectId]/epics` with structured epic data. It should parse the conversation to extract the epic title, description, and user stories from Claude's responses.",
          "acceptance_criteria": "- [ ] `useEpicCreate` hook created in `hooks/` directory\n- [ ] Hook accepts projectId and conversationId parameters\n- [ ] Calls POST endpoint to create epic with user stories\n- [ ] Returns `{ createEpic, isLoading, error, createdEpic }` interface\n- [ ] Handles API errors gracefully with user-friendly messages\n- [ ] Triggers kanban board refresh on successful creation",
          "status": "todo",
          "position": 1
        },
        {
          "id": "Yam7zSmWBG2w",
          "title": "As a user, I want the UnifiedChatPanel to support epic creation tabs with a create button and distinct icons so that I can create epics directly from the chat",
          "description": "Update the UnifiedChatPanel component to: (1) show a sparkles icon on `epic_creation` tabs vs a message icon on regular chat tabs, (2) display a 'Create Epic & Generate Stories' action button in `epic_creation` conversations once sufficient context exists, (3) show an empty-state hint in new epic_creation tabs explaining the workflow, (4) fire an `onEpicCreated` callback that refreshes the board.",
          "acceptance_criteria": "- [ ] Epic creation tabs show a sparkles/star icon in the tab bar\n- [ ] Regular chat tabs show a message/chat icon in the tab bar\n- [ ] 'Create Epic & Generate Stories' button appears in epic_creation conversations\n- [ ] Button triggers the useEpicCreate hook and shows loading state\n- [ ] Empty-state hint displayed in new epic_creation tabs: e.g. 'Describe your epic idea and I'll help you structure it with user stories'\n- [ ] `onEpicCreated` callback fires on successful epic creation\n- [ ] Kanban board refreshes when a new epic is created from the panel",
          "status": "todo",
          "position": 2
        },
        {
          "id": "hq1XPaVpz3IX",
          "title": "As a user, I want context-aware placeholder text in the chat input so that I know what to type in each conversation type",
          "description": "Add a `placeholder` prop to the MessageInput component. Set the placeholder based on the conversation type: 'Describe your epic idea...' for `epic_creation` tabs, 'Ask a question...' for brainstorm tabs. The placeholder should be visually clear but disappear on focus/input.",
          "acceptance_criteria": "- [ ] MessageInput component accepts an optional `placeholder` prop\n- [ ] Default placeholder is 'Ask a question...' when no prop is provided\n- [ ] Epic creation conversations pass 'Describe your epic idea...' as placeholder\n- [ ] Placeholder text is visually muted (gray) and disappears on input\n- [ ] No breaking changes to existing MessageInput usage",
          "status": "todo",
          "position": 3
        },
        {
          "id": "eK1L9Qptf1ie",
          "title": "As a user, I want the 'New Epic' button to open an epic creation tab in the chat panel so that I don't need a separate modal",
          "description": "Rewire the 'New Epic' button in the project page toolbar to call `panelRef.current?.openNewEpic()` which expands the chat panel and creates a new tab with `epic_creation` type pre-selected. Remove the old CreateEpicSheet modal import and rendering from the page. Ensure the panel opens in expanded state if it was collapsed.",
          "acceptance_criteria": "- [ ] 'New Epic' button in project page calls `openNewEpic()` on the panel ref\n- [ ] Panel expands if currently collapsed when 'New Epic' is clicked\n- [ ] A new tab is created with conversation type `epic_creation`\n- [ ] The new tab is focused/active immediately\n- [ ] Old CreateEpicSheet modal no longer renders on the page\n- [ ] No regression in 'Chat' button behavior",
          "status": "todo",
          "position": 4
        },
        {
          "id": "fpZHtET5OY8K",
          "title": "As a developer, I want dead code from the old epic creation flow removed so that the codebase stays clean",
          "description": "Delete the now-unused `CreateEpicSheet.tsx` component and `useEpicCreation.ts` hook. Remove any unused imports referencing these files from other components. Verify that no other part of the codebase depends on these files before deletion.",
          "acceptance_criteria": "- [ ] `CreateEpicSheet.tsx` file deleted\n- [ ] `useEpicCreation.ts` file deleted\n- [ ] All imports of these files removed from other components\n- [ ] No TypeScript compilation errors after deletion\n- [ ] No runtime errors — verify the app builds successfully",
          "status": "todo",
          "position": 5
        }
      ]
    },
    {
      "id": "_iXuiyo_bsrs",
      "title": "Agent Configuration Side Panel & Custom Review Agents",
      "description": "Dedicated side panel for configuring agent prompts (global + per-project override), creating custom review agents, and setting the default AI provider per agent type.\n\n## Implementation Plan\n\n### Phase 1 — Schema & Data Layer\n\n**Agent Prompts Table:**\n- Add `agentPrompts` table: id, agentType (text: 'build', 'review_security', 'review_code', 'review_compliance', 'chat', 'spec_generation', 'team_build', 'ticket_build'), systemPrompt (text), scope ('global' | projectId), createdAt, updatedAt\n- Global prompts have scope='global', project overrides store the projectId\n- When resolving a prompt, project-scoped prompt takes precedence over global, which takes precedence over built-in defaults\n\n**Custom Review Agents Table:**\n- Add `customReviewAgents` table: id, name (text), systemPrompt (text), scope ('global' | projectId), position (integer), isEnabled (integer, default 1), createdAt, updatedAt\n- Custom review agents are user-defined and appear alongside the 3 built-in review types\n\n**Agent Provider Defaults Table:**\n- Add `agentProviderDefaults` table: id, agentType (text), provider ('claude-code' | 'codex'), scope ('global' | projectId), createdAt, updatedAt\n- Allows setting CC or Codex as default per agent type, with project override\n\n### Phase 2 — API Routes\n\n**Agent Prompts:**\n- `GET /api/agent-config/prompts` — list all global agent prompts\n- `GET /api/projects/[projectId]/agent-config/prompts` — list project-scoped prompts (merged with global defaults)\n- `PUT /api/agent-config/prompts/[agentType]` — upsert global prompt for an agent type\n- `PUT /api/projects/[projectId]/agent-config/prompts/[agentType]` — upsert project override\n- `DELETE /api/projects/[projectId]/agent-config/prompts/[agentType]` — remove project override (fall back to global)\n\n**Custom Review Agents:**\n- `GET /api/agent-config/review-agents` — list global custom review agents\n- `GET /api/projects/[projectId]/agent-config/review-agents` — list project-scoped + global review agents\n- `POST /api/agent-config/review-agents` — create a custom review agent (global)\n- `POST /api/projects/[projectId]/agent-config/review-agents` — create project-scoped review agent\n- `PATCH /api/agent-config/review-agents/[agentId]` — update name, prompt, enabled status\n- `DELETE /api/agent-config/review-agents/[agentId]` — delete a custom review agent\n\n**Agent Provider Defaults:**\n- `GET /api/agent-config/providers` — list global provider defaults per agent type\n- `PUT /api/agent-config/providers/[agentType]` — set global default provider for agent type\n- `PUT /api/projects/[projectId]/agent-config/providers/[agentType]` — set project override\n\n### Phase 3 — Prompt Builder Integration\n- Refactor all prompt builder functions to load custom prompts from DB before composing\n- Resolution order: project override → global custom → built-in default\n- Update `buildReviewPrompt` to accept custom review agent prompts in addition to built-in types\n- Update `buildBuildPrompt`, `buildChatPrompt`, `buildSpecPrompt`, `buildTeamBuildPrompt`, `buildTicketBuildPrompt` to use configurable prompts\n\n### Phase 4 — Side Panel UI\n- New `AgentConfigPanel` component accessible from the main sidebar\n- Three tabs: **Agent Prompts**, **Review Agents**, **Provider Defaults**\n- Agent Prompts tab: list of agent types with expandable prompt editors, toggle between global/project scope\n- Review Agents tab: list of built-in (read-only name) + custom review agents, each with name/prompt fields, add/delete actions\n- Provider Defaults tab: per-agent-type dropdown to select CC or Codex as default\n- Panel slides in from the left sidebar, can be toggled open/closed\n\n### Phase 5 — Review Dialog Integration\n- Update the Agent Review dialog on the story detail page to include custom review agents alongside the 3 built-in types\n- Custom agents displayed as additional checkboxes with their name\n- Each selected custom agent dispatches a plan-mode agent with the custom prompt\n- Agent output posted as a comment with the custom agent's name as label",
      "priority": 0,
      "status": "done",
      "position": 32,
      "branchName": null,
      "user_stories": [
        {
          "id": "tx-Zl7tpROpQ",
          "title": "As a developer, I want database tables for agent prompts, custom review agents, and provider defaults so that agent configuration is persisted",
          "description": "Add three new tables to the Drizzle schema: `agentPrompts` (id, agentType, systemPrompt, scope, createdAt, updatedAt), `customReviewAgents` (id, name, systemPrompt, scope, position, isEnabled, createdAt, updatedAt), and `agentProviderDefaults` (id, agentType, provider, scope, createdAt, updatedAt). The `scope` field is 'global' for app-wide config or a projectId for project overrides. Generate and push the migration.",
          "acceptance_criteria": "- [ ] `agentPrompts` table added to `lib/db/schema.ts` with agentType, systemPrompt, scope fields\n- [ ] `customReviewAgents` table added with name, systemPrompt, scope, position, isEnabled fields\n- [ ] `agentProviderDefaults` table added with agentType, provider, scope fields\n- [ ] Unique constraint on (agentType, scope) for agentPrompts and agentProviderDefaults\n- [ ] Unique constraint on (name, scope) for customReviewAgents\n- [ ] Drizzle migration generated and pushed successfully\n- [ ] TypeScript types exported for all new tables",
          "status": "review",
          "position": 0
        },
        {
          "id": "UtjggzzkB6Hv",
          "title": "As a developer, I want API routes for managing agent prompts so that I can configure system prompts per agent type globally and per project",
          "description": "Create CRUD API routes for agent prompts. `GET /api/agent-config/prompts` returns all global prompts. `PUT /api/agent-config/prompts/[agentType]` upserts a global prompt. `GET /api/projects/[projectId]/agent-config/prompts` returns merged prompts (project override > global > built-in). `PUT/DELETE` on project-scoped route manages overrides. Built-in defaults are returned when no custom prompt exists.",
          "acceptance_criteria": "- [ ] `GET /api/agent-config/prompts` returns all global agent prompts with built-in defaults for missing types\n- [ ] `PUT /api/agent-config/prompts/[agentType]` upserts global prompt (validates agentType is known)\n- [ ] `GET /api/projects/[projectId]/agent-config/prompts` returns merged view with project overrides\n- [ ] `PUT /api/projects/[projectId]/agent-config/prompts/[agentType]` upserts project-scoped override\n- [ ] `DELETE /api/projects/[projectId]/agent-config/prompts/[agentType]` removes project override\n- [ ] Consistent `{ data }` / `{ error }` response shape\n- [ ] Known agent types: build, review_security, review_code, review_compliance, chat, spec_generation, team_build, ticket_build",
          "status": "review",
          "position": 1
        },
        {
          "id": "WrhNpCAaTHeQ",
          "title": "As a developer, I want API routes for custom review agents so that I can create, edit, and delete specialized review agents",
          "description": "Create CRUD API routes for custom review agents. `POST /api/agent-config/review-agents` creates a global custom review agent with a name and system prompt. `PATCH` updates name/prompt/enabled. `DELETE` removes the agent. Project-scoped routes allow project-specific review agents. `GET` returns combined list of global + project-scoped agents.",
          "acceptance_criteria": "- [ ] `GET /api/agent-config/review-agents` returns all global custom review agents\n- [ ] `POST /api/agent-config/review-agents` creates a custom review agent with name and systemPrompt\n- [ ] `PATCH /api/agent-config/review-agents/[agentId]` updates name, systemPrompt, or isEnabled\n- [ ] `DELETE /api/agent-config/review-agents/[agentId]` deletes a custom review agent\n- [ ] `GET /api/projects/[projectId]/agent-config/review-agents` returns global + project-scoped agents\n- [ ] `POST /api/projects/[projectId]/agent-config/review-agents` creates project-scoped agent\n- [ ] Name uniqueness validated within scope\n- [ ] Consistent `{ data }` / `{ error }` response shape",
          "status": "review",
          "position": 2
        },
        {
          "id": "Devxf446SeBA",
          "title": "As a developer, I want API routes for agent provider defaults so that I can set Claude Code or Codex as the default per agent type",
          "description": "Create API routes for managing default provider per agent type. `GET /api/agent-config/providers` returns all global defaults. `PUT /api/agent-config/providers/[agentType]` sets the global default provider for an agent type. Project-scoped routes allow per-project overrides. Defaults to 'claude-code' when no configuration exists.",
          "acceptance_criteria": "- [ ] `GET /api/agent-config/providers` returns provider defaults for all agent types\n- [ ] `PUT /api/agent-config/providers/[agentType]` sets global default provider ('claude-code' or 'codex')\n- [ ] `PUT /api/projects/[projectId]/agent-config/providers/[agentType]` sets project-scoped override\n- [ ] `GET /api/projects/[projectId]/agent-config/providers` returns merged defaults (project > global > 'claude-code')\n- [ ] Validates provider value is 'claude-code' or 'codex'\n- [ ] Consistent `{ data }` / `{ error }` response shape",
          "status": "review",
          "position": 3
        },
        {
          "id": "pkFmc04YaYAg",
          "title": "As a developer, I want the prompt builder to use configurable prompts so that custom agent prompts are injected into all Claude Code sessions",
          "description": "Refactor all prompt builder functions (`buildBuildPrompt`, `buildChatPrompt`, `buildSpecPrompt`, `buildTeamBuildPrompt`, `buildTicketBuildPrompt`, `buildReviewPrompt`) to load custom prompts from the database before composing. Resolution order: project-scoped override → global custom prompt → existing built-in default. Update `buildReviewPrompt` to accept custom review agent prompts alongside built-in review types.",
          "acceptance_criteria": "- [ ] All prompt builders accept an optional custom system prompt parameter\n- [ ] New `resolveAgentPrompt(agentType, projectId?)` helper queries DB and returns the resolved prompt\n- [ ] Resolution order: project override → global custom → built-in default\n- [ ] `buildReviewPrompt` supports custom review agent types with their own system prompts\n- [ ] Build, chat, spec, team build, and ticket build prompt builders all use `resolveAgentPrompt`\n- [ ] Built-in default prompts extracted as constants for fallback\n- [ ] No behavioral change when no custom prompts are configured (backwards compatible)",
          "status": "review",
          "position": 4
        },
        {
          "id": "74Bovpp-m5Yn",
          "title": "As a developer, I want an Agent Configuration side panel so that I can manage agent prompts, review agents, and provider defaults from a dedicated UI",
          "description": "Create an `AgentConfigPanel` component that slides in from the main sidebar. The panel has three tabs: Agent Prompts (list of agent types with expandable textarea editors, global/project scope toggle), Review Agents (list of built-in + custom agents with add/edit/delete), and Provider Defaults (per-agent dropdown to select CC or Codex). Add a sidebar icon/button to toggle the panel. When inside a project view, show project-scoped config with option to fall back to global.",
          "acceptance_criteria": "- [ ] `AgentConfigPanel` component renders as a slide-in panel from the sidebar\n- [ ] Sidebar button/icon to toggle the panel open/closed\n- [ ] Agent Prompts tab lists all agent types with expandable prompt editors\n- [ ] Each prompt editor shows built-in default as placeholder, custom prompt as value\n- [ ] Scope toggle (Global / Project) when inside a project view\n- [ ] Review Agents tab lists built-in agents (name read-only) and custom agents (editable)\n- [ ] Add button to create a new custom review agent with name and prompt fields\n- [ ] Delete button on custom review agents with confirmation\n- [ ] Provider Defaults tab shows dropdown per agent type with Claude Code / Codex options\n- [ ] All changes saved via API with loading states and success/error feedback\n- [ ] Panel uses shadcn/ui components consistent with existing UI",
          "status": "review",
          "position": 5
        },
        {
          "id": "jHak6e2XpW0D",
          "title": "As a developer, I want custom review agents to appear in the Agent Review dialog so that I can trigger specialized reviews on tickets",
          "description": "Update the Agent Review dialog on the story detail page to dynamically load custom review agents from the API alongside the 3 built-in review types (Security, Code Review, Compliance). Custom agents are displayed as additional checkboxes with their name. Each selected custom agent dispatches a plan-mode agent with its custom system prompt. Agent output is posted as a comment with the custom agent's name as label.",
          "acceptance_criteria": "- [ ] Agent Review dialog fetches custom review agents from API on open\n- [ ] Custom agents displayed as checkboxes alongside built-in review types\n- [ ] Disabled custom agents (isEnabled=false) are hidden from the dialog\n- [ ] Review API route (`POST .../review`) accepts custom agent IDs in addition to built-in type strings\n- [ ] Each selected custom agent dispatches a plan-mode session with its system prompt\n- [ ] Agent output posted as comment with custom agent name as label (e.g., 'UI Review')\n- [ ] Built-in review types continue to work unchanged",
          "status": "review",
          "position": 6
        },
        {
          "id": "Uap-yetNoenX",
          "title": "As a developer, I want provider defaults to be used automatically in build, review, and chat flows so that I don't have to select the provider each time",
          "description": "Update all action flows (build toolbar, send-to-dev, agent review, chat) to read the configured default provider for the relevant agent type before dispatching. The provider selector UI should pre-select the configured default instead of always defaulting to Claude Code. Manual selection still overrides the default for that session.",
          "acceptance_criteria": "- [ ] Build toolbar pre-selects the configured default provider for 'build' agent type\n- [ ] Send-to-dev dialog pre-selects the default provider for 'ticket_build' agent type\n- [ ] Agent Review dialog uses the default provider for each review agent type\n- [ ] Chat panel pre-selects the default provider for 'chat' agent type\n- [ ] Manual provider selection overrides the default for that action\n- [ ] Falls back to 'claude-code' when no default is configured\n- [ ] Provider defaults resolved with project > global > 'claude-code' precedence",
          "status": "review",
          "position": 7
        }
      ]
    },
    {
      "id": "o6pppVoehWCp",
      "title": "Sessions Tab Readability and Activity Summary UX",
      "description": "Make the Sessions tab readable under real-world payload sizes and surface concise live progress text for running sessions.",
      "priority": 2,
      "status": "done",
      "position": 33,
      "branchName": null,
      "user_stories": [
        {
          "id": "DV_P9gjppaaz",
          "title": "As a product user, I want scrollable log viewers so that long responses and logs stay contained and readable",
          "description": "Wrap responses/raw/output in bounded scroll containers to prevent overflow and preserve layout integrity.",
          "acceptance_criteria": "- [ ] `Responses`, `Raw log`, and `Output` each render inside contained scrollable viewers with fixed max height\n- [ ] No log content spills outside the session tab container at any viewport size\n- [ ] Very long entries remain accessible through vertical scrolling\n- [ ] Viewer layout is responsive on desktop and mobile widths",
          "status": "todo",
          "position": 0
        },
        {
          "id": "BUvrycgTj3OQ",
          "title": "As a product user, I want improved text formatting so that raw logs and outputs are easier to inspect",
          "description": "Use monospace rendering, safe wrapping, and lightweight formatting for JSON payloads with copy support.",
          "acceptance_criteria": "- [ ] Raw logs render in monospace with preserved line breaks\n- [ ] Long lines wrap safely or provide horizontal scrolling without overlapping sibling UI\n- [ ] JSON-like payloads are pretty-printed when valid JSON is detected\n- [ ] Copy-to-clipboard action copies full underlying content",
          "status": "todo",
          "position": 1
        },
        {
          "id": "aL5DqzKJrClH",
          "title": "As a product user, I want to see elapsed time with the latest meaningful text so that I can understand active progress quickly",
          "description": "Consume `lastNonEmptyText` from session APIs and render a concise line beside elapsed time in running rows.",
          "acceptance_criteria": "- [ ] Session rows display elapsed time plus truncated `lastNonEmptyText` while running\n- [ ] Empty summary gracefully falls back to a neutral placeholder\n- [ ] Summary updates live during polling without full page refresh",
          "status": "todo",
          "position": 2
        }
      ]
    },
    {
      "id": "r4WR9sYAiFJV",
      "title": "Fuse New Epic into Chat Panel",
      "description": "Remove the standalone 'New Epic' modal/flow and instead open epic creation as a new tab in the existing UnifiedChatPanel. When the user clicks 'New Epic', the chat panel opens with a new tab of type `epic_creation`. The chat stream API route checks the conversation type and uses the epic refinement prompt for `epic_creation` conversations. After the brainstorming chat converges, a 'Create Epic & Generate Stories' button triggers epic + user story creation from the conversation context.\n\n## Implementation Plan\n\n### Step 1 — Server-side routing in /api/chat/stream\n- Modify the chat stream endpoint to check the conversation's `type` field\n- When type is `epic_creation`, use the epic refinement prompt builder (existing `buildSpecPrompt` or a new `buildEpicCreationPrompt`) instead of the default brainstorm prompt\n- Ensure the prompt includes project context (spec, documents) and instructs Claude to help the user define an epic with user stories\n\n### Step 2 — New useEpicCreate hook\n- Create a small React hook (`useEpicCreate`) that takes the conversation context and calls the API to create an epic with generated user stories\n- The hook calls `POST /api/projects/[projectId]/epics` with the epic data extracted from the conversation\n- Returns loading/error/success states\n\n### Step 3 — UnifiedChatPanel UI updates\n- Add a 'Create Epic & Generate Stories' button that appears in `epic_creation` conversations once enough context has been discussed\n- Differentiate tab icons: sparkles icon for `epic_creation` tabs vs message icon for regular chat tabs\n- Add an empty-state hint in new `epic_creation` tabs explaining what the user can do\n- Wire `onEpicCreated` callback to refresh the kanban board and optionally close the tab\n\n### Step 4 — MessageInput placeholder\n- Add a `placeholder` prop to the MessageInput component\n- Set context-aware placeholder text: 'Describe your epic idea...' for epic_creation tabs, 'Ask a question...' for brainstorm tabs\n\n### Step 5 — Rewire page.tsx\n- Point the 'New Epic' button in the project page to `panelRef.current?.openNewEpic()` which creates a new `epic_creation` tab\n- Remove the old modal/sheet import and rendering\n\n### Step 6 — Delete dead code\n- Remove `CreateEpicSheet.tsx` component\n- Remove `useEpicCreation.ts` hook\n- Clean up any unused imports",
      "priority": 2,
      "status": "done",
      "position": 34,
      "branchName": null,
      "user_stories": [
        {
          "id": "XnIfb-vCspr5",
          "title": "As a user, I want the chat stream API to use the epic refinement prompt for epic_creation conversations so that Claude guides me through epic definition",
          "description": "Modify `/api/chat/stream` (or the relevant chat API route) to check the conversation's `type` field. When the type is `epic_creation`, compose the prompt using the epic refinement/spec prompt builder instead of the default brainstorm prompt. The prompt should include project context (spec, documents, existing epics) and instruct Claude to help the user define a well-structured epic with user stories and acceptance criteria.",
          "acceptance_criteria": "- [ ] Chat stream route reads conversation `type` from DB or request\n- [ ] When type is `epic_creation`, epic refinement prompt builder is used\n- [ ] Epic refinement prompt includes project spec, documents, and existing epic titles for context\n- [ ] Prompt instructs Claude to guide the user through epic definition (title, description, user stories, acceptance criteria)\n- [ ] Default brainstorm prompt still used for non-epic_creation conversations\n- [ ] No breaking changes to existing chat functionality",
          "status": "review",
          "position": 0
        },
        {
          "id": "ZJ0Uj0Y19Zgm",
          "title": "As a user, I want a useEpicCreate hook so that epic creation from conversation context is handled cleanly",
          "description": "Create a `useEpicCreate` React hook that takes the conversation ID and project ID, calls the API to create an epic with user stories derived from the conversation, and returns loading/error/success states. The hook calls `POST /api/projects/[projectId]/epics` with structured epic data. It should parse the conversation to extract the epic title, description, and user stories from Claude's responses.",
          "acceptance_criteria": "- [ ] `useEpicCreate` hook created in `hooks/` directory\n- [ ] Hook accepts projectId and conversationId parameters\n- [ ] Calls POST endpoint to create epic with user stories\n- [ ] Returns `{ createEpic, isLoading, error, createdEpic }` interface\n- [ ] Handles API errors gracefully with user-friendly messages\n- [ ] Triggers kanban board refresh on successful creation",
          "status": "review",
          "position": 1
        },
        {
          "id": "O_hfiEgecQ9D",
          "title": "As a user, I want the UnifiedChatPanel to support epic creation tabs with a create button and distinct icons so that I can create epics directly from the chat",
          "description": "Update the UnifiedChatPanel component to: (1) show a sparkles icon on `epic_creation` tabs vs a message icon on regular chat tabs, (2) display a 'Create Epic & Generate Stories' action button in `epic_creation` conversations once sufficient context exists, (3) show an empty-state hint in new epic_creation tabs explaining the workflow, (4) fire an `onEpicCreated` callback that refreshes the board.",
          "acceptance_criteria": "- [ ] Epic creation tabs show a sparkles/star icon in the tab bar\n- [ ] Regular chat tabs show a message/chat icon in the tab bar\n- [ ] 'Create Epic & Generate Stories' button appears in epic_creation conversations\n- [ ] Button triggers the useEpicCreate hook and shows loading state\n- [ ] Empty-state hint displayed in new epic_creation tabs: e.g. 'Describe your epic idea and I'll help you structure it with user stories'\n- [ ] `onEpicCreated` callback fires on successful epic creation\n- [ ] Kanban board refreshes when a new epic is created from the panel",
          "status": "review",
          "position": 2
        },
        {
          "id": "fGs9ZIm9AN2r",
          "title": "As a user, I want context-aware placeholder text in the chat input so that I know what to type in each conversation type",
          "description": "Add a `placeholder` prop to the MessageInput component. Set the placeholder based on the conversation type: 'Describe your epic idea...' for `epic_creation` tabs, 'Ask a question...' for brainstorm tabs. The placeholder should be visually clear but disappear on focus/input.",
          "acceptance_criteria": "- [ ] MessageInput component accepts an optional `placeholder` prop\n- [ ] Default placeholder is 'Ask a question...' when no prop is provided\n- [ ] Epic creation conversations pass 'Describe your epic idea...' as placeholder\n- [ ] Placeholder text is visually muted (gray) and disappears on input\n- [ ] No breaking changes to existing MessageInput usage",
          "status": "review",
          "position": 3
        },
        {
          "id": "2Ti8YYRok3Cz",
          "title": "As a user, I want the 'New Epic' button to open an epic creation tab in the chat panel so that I don't need a separate modal",
          "description": "Rewire the 'New Epic' button in the project page toolbar to call `panelRef.current?.openNewEpic()` which expands the chat panel and creates a new tab with `epic_creation` type pre-selected. Remove the old CreateEpicSheet modal import and rendering from the page. Ensure the panel opens in expanded state if it was collapsed.",
          "acceptance_criteria": "- [ ] 'New Epic' button in project page calls `openNewEpic()` on the panel ref\n- [ ] Panel expands if currently collapsed when 'New Epic' is clicked\n- [ ] A new tab is created with conversation type `epic_creation`\n- [ ] The new tab is focused/active immediately\n- [ ] Old CreateEpicSheet modal no longer renders on the page\n- [ ] No regression in 'Chat' button behavior",
          "status": "review",
          "position": 4
        },
        {
          "id": "JpWx4WRK1fbA",
          "title": "As a developer, I want dead code from the old epic creation flow removed so that the codebase stays clean",
          "description": "Delete the now-unused `CreateEpicSheet.tsx` component and `useEpicCreation.ts` hook. Remove any unused imports referencing these files from other components. Verify that no other part of the codebase depends on these files before deletion.",
          "acceptance_criteria": "- [ ] `CreateEpicSheet.tsx` file deleted\n- [ ] `useEpicCreation.ts` file deleted\n- [ ] All imports of these files removed from other components\n- [ ] No TypeScript compilation errors after deletion\n- [ ] No runtime errors — verify the app builds successfully",
          "status": "review",
          "position": 5
        }
      ]
    },
    {
      "id": "4wJJ42xg9gz3",
      "title": "Agent Teams & Codex Provider Integration",
      "description": "Two-part feature: (1) Agent Teams mode that leverages Claude Code's native Task tool to delegate multiple tickets to sub-agents in a single session, and (2) OpenAI Codex integration as an alternative AI provider alongside Claude Code.\n\n## Implementation Plan\n\n### Part A — Agent Teams (Claude Code Only)\n\n**Schema & Data Layer:**\n- Add `orchestrationMode` column to `agentSessions` table (`'solo' | 'team'`, default `'solo'`)\n- Team mode is exclusive to Claude Code (Codex has no equivalent sub-agent delegation)\n\n**Prompt Builder:**\n- New `buildTeamBuildPrompt()` function that describes all selected epics with their worktree paths\n- Instructs Claude Code to act as a team lead and use the `Task` tool to spawn sub-agents per ticket\n- Lets CC decide team composition and size\n\n**Build Route Changes:**\n- When `team=true` in the batch build request, pre-create all git worktrees for selected epics\n- Spawn a single CC session from the main repo root (not inside a worktree)\n- Add `Task` to the `--allowedTools` list for team mode\n- Track as a single `agentSession` with `orchestrationMode: 'team'`\n- On completion, update all associated epics' statuses\n\n**UI — Build Toolbar:**\n- Add 'Team mode' checkbox in the build toolbar, visible when 2+ epics are selected\n- Checkbox disabled when fewer than 2 epics selected or when provider is Codex\n- Tooltip explains team mode behavior\n\n### Part B — Codex Provider Integration\n\n**Provider Abstraction Layer:**\n- New `lib/providers/` directory with provider interface (`AgentProvider`)\n- `lib/providers/claude-code.ts` — wraps existing CC spawn logic\n- `lib/providers/codex.ts` — wraps `@openai/codex-sdk` using `Codex` class, `startThread()`, `runStreamed()` for streaming events\n- `lib/providers/index.ts` — factory function `getProvider(type: 'claude-code' | 'codex')`\n- Codex provider uses `workingDirectory` option on `startThread()` for worktree paths\n\n**Schema Changes:**\n- Add `provider` column to `agentSessions` (`'claude-code' | 'codex'`, default `'claude-code'`)\n- Add `provider` column to `chatConversations` (if table exists) or chat messages\n\n**Process Manager Generalization:**\n- Refactor `lib/claude/process-manager.ts` to accept provider-agnostic session handles\n- Codex sessions tracked via thread ID, CC sessions tracked via PID\n- Unified start/cancel/status interface\n\n**Build & Review Routes:**\n- Build route accepts `provider` parameter, dispatches via provider factory\n- Review route accepts `provider` parameter\n- Send-to-dev route accepts `provider` parameter\n\n**UI — Provider Selector:**\n- Dropdown in build toolbar to choose between Claude Code and Codex\n- Provider selector in Send to Dev dialog\n- Provider selector in Agent Review dialog\n- Provider toggle in chat header (locked/disabled after first message in conversation)\n- Codex option disabled with tooltip if no API key configured\n\n**Settings:**\n- Add Codex API key field to Settings page\n- Stored in `settings` table with key `codex_api_key`\n- Validated on save (non-empty string check)\n\n**Codex SDK Integration Details:**\n- Install `@openai/codex-sdk` dependency\n- Use `new Codex({ env: { CODEX_API_KEY: ... } })` with API key from settings\n- `startThread({ workingDirectory })` for worktree-scoped execution\n- `runStreamed()` for streaming events, map to unified event format\n- Thread IDs stored in session metadata for resumption support",
      "priority": 0,
      "status": "done",
      "position": 35,
      "branchName": null,
      "user_stories": [
        {
          "id": "2WI6CAV-8z1G",
          "title": "As a developer, I want an orchestrationMode column on agent sessions so that team-mode builds are tracked separately from solo builds",
          "description": "Add `orchestrationMode` column to the `agentSessions` table in the Drizzle schema with values 'solo' (default) or 'team'. This column distinguishes single-epic builds from multi-epic team-mode sessions. Add `provider` column to `agentSessions` with values 'claude-code' (default) or 'codex'. Push the schema changes.",
          "acceptance_criteria": "- [ ] `orchestrationMode` column added to `agentSessions` with type text, default 'solo'\n- [ ] `provider` column added to `agentSessions` with type text, default 'claude-code'\n- [ ] `provider` column added to chat-related table (chatMessages or chatConversations) if applicable\n- [ ] Drizzle migration generated and pushed successfully\n- [ ] Existing agent session queries still work (default values applied)\n- [ ] TypeScript types updated to reflect new columns",
          "status": "review",
          "position": 0
        },
        {
          "id": "cgMW3seh5ZMS",
          "title": "As a developer, I want a provider abstraction layer so that Claude Code and Codex can be used interchangeably for builds and reviews",
          "description": "Create `lib/providers/` directory with a unified `AgentProvider` interface. Implement `claude-code.ts` wrapping the existing CC spawn logic and `codex.ts` wrapping `@openai/codex-sdk`. Add a factory function `getProvider(type)` that returns the appropriate provider. Install `@openai/codex-sdk` as a dependency.",
          "acceptance_criteria": "- [ ] `lib/providers/types.ts` defines `AgentProvider` interface with `spawn`, `cancel`, `getStatus` methods\n- [ ] `lib/providers/claude-code.ts` wraps existing CC spawn logic, implements `AgentProvider`\n- [ ] `lib/providers/codex.ts` wraps `@openai/codex-sdk` using `Codex` class, `startThread()`, `runStreamed()`\n- [ ] `lib/providers/index.ts` exports `getProvider('claude-code' | 'codex')` factory\n- [ ] `@openai/codex-sdk` added to package.json dependencies\n- [ ] Codex provider uses `workingDirectory` option on `startThread()` for worktree paths\n- [ ] Codex provider reads API key from settings table",
          "status": "review",
          "position": 1
        },
        {
          "id": "j77dMFfKjrlp",
          "title": "As a developer, I want a team build prompt so that Claude Code can act as team lead and delegate tickets to sub-agents",
          "description": "Create `buildTeamBuildPrompt()` in `lib/claude/prompt-builder.ts`. The prompt describes all selected epics with their worktree paths, user stories, and acceptance criteria. It instructs Claude Code to act as a team lead, use the `Task` tool to spawn sub-agents, and lets CC decide team composition and task allocation.",
          "acceptance_criteria": "- [ ] `buildTeamBuildPrompt()` function added to prompt-builder.ts\n- [ ] Prompt includes project spec and global prompt\n- [ ] Prompt lists all selected epics with their titles, descriptions, and user stories\n- [ ] Each epic's worktree path is included so sub-agents know where to work\n- [ ] Prompt instructs CC to use `Task` tool for delegation\n- [ ] Prompt explicitly tells CC to decide team size and composition\n- [ ] Prompt includes build instructions (commit conventions, testing expectations)",
          "status": "review",
          "position": 2
        },
        {
          "id": "gr169dFuJ-v1",
          "title": "As a developer, I want the batch build route to support team mode so that a single CC session manages multiple epics via sub-agents",
          "description": "Modify the batch build API route (`app/api/projects/[projectId]/build/route.ts`). When `team=true` is passed, pre-create all git worktrees for the selected epics, then spawn ONE Claude Code session from the main repo root with `Task` in `--allowedTools`. Track as a single `agentSession` with `orchestrationMode: 'team'`. On completion, update all associated epics' statuses.",
          "acceptance_criteria": "- [ ] Build route accepts `team: boolean` parameter in request body\n- [ ] When `team=true`, all selected epic worktrees are pre-created before CC spawn\n- [ ] Single CC session spawned from main repo root (not inside a worktree)\n- [ ] `Task` added to `--allowedTools` for team-mode sessions\n- [ ] Session created with `orchestrationMode: 'team'` in database\n- [ ] All selected epic IDs associated with the team session\n- [ ] On session completion, all associated epics' statuses are updated\n- [ ] When `team=false` or absent, existing solo-mode behavior preserved",
          "status": "review",
          "position": 3
        },
        {
          "id": "Ea5JQEGJ4Yuw",
          "title": "As a developer, I want the build route and action routes to accept a provider parameter so that I can choose between Claude Code and Codex",
          "description": "Update the batch build route, send-to-dev route, and agent review route to accept an optional `provider` parameter ('claude-code' or 'codex'). Use the provider factory to dispatch to the correct backend. Store the provider in the created `agentSession` record. Default to 'claude-code' if not specified.",
          "acceptance_criteria": "- [ ] Batch build route (`/api/projects/[projectId]/build`) accepts `provider` parameter\n- [ ] Send-to-dev route (`/api/projects/[projectId]/epics/[epicId]/build` or stories route) accepts `provider` parameter\n- [ ] Review route accepts `provider` parameter\n- [ ] Provider factory used to dispatch to correct backend\n- [ ] `provider` field stored in created `agentSession` records\n- [ ] Default to 'claude-code' when `provider` not specified\n- [ ] Team mode rejected with error if `provider` is 'codex' (Codex has no Task tool)",
          "status": "review",
          "position": 4
        },
        {
          "id": "iH2s5SpSEO_e",
          "title": "As a developer, I want the process manager generalized so that both CC and Codex sessions can be tracked and cancelled uniformly",
          "description": "Refactor `lib/claude/process-manager.ts` to handle provider-agnostic session tracking. CC sessions are tracked by PID (existing behavior). Codex sessions are tracked by thread ID. Provide a unified start/cancel/status/listActive interface that works for both providers.",
          "acceptance_criteria": "- [ ] Process manager accepts a `provider` type when registering a new session\n- [ ] CC sessions tracked by PID with SIGTERM→SIGKILL fallback (existing behavior preserved)\n- [ ] Codex sessions tracked by thread ID, cancellation via Codex SDK API\n- [ ] `listActive()`, `getStatus()`, `cancel()` work uniformly across both providers\n- [ ] Session metadata includes provider type for display purposes\n- [ ] No breaking changes to existing CC session management",
          "status": "review",
          "position": 5
        },
        {
          "id": "u901zMPbQl0S",
          "title": "As a developer, I want a Team mode checkbox in the build toolbar so that I can launch multi-epic builds as a coordinated team",
          "description": "Add a 'Team mode' checkbox to the kanban build toolbar. The checkbox is visible when 2 or more epics are selected and the provider is Claude Code. When checked, the build request includes `team: true`. Add a tooltip explaining that team mode lets CC coordinate sub-agents. Disable the checkbox when fewer than 2 epics are selected or when Codex is the selected provider.",
          "acceptance_criteria": "- [ ] 'Team mode' checkbox rendered in build toolbar next to the Build button\n- [ ] Checkbox only visible when 2+ epics are selected\n- [ ] Checkbox disabled with tooltip when provider is Codex\n- [ ] Checking the box passes `team: true` in the build API request\n- [ ] Tooltip explains team mode: 'Launch a single CC session that coordinates sub-agents for each epic'\n- [ ] Unchecked by default (solo mode is the default behavior)\n- [ ] Checkbox state resets when selection changes to fewer than 2 epics",
          "status": "review",
          "position": 6
        },
        {
          "id": "qr-JVz_Q3_H6",
          "title": "As a developer, I want a provider selector in the build toolbar, Send to Dev dialog, and Agent Review dialog so that I can choose between Claude Code and Codex",
          "description": "Add a dropdown/toggle to select the AI provider in: (1) the kanban build toolbar, (2) the Send to Dev dialog, (3) the Agent Review dialog. The selector shows 'Claude Code' and 'Codex' options. Codex option is disabled with a tooltip if no API key is configured in settings. The selected provider is passed to the respective API routes.",
          "acceptance_criteria": "- [ ] Provider dropdown in build toolbar with Claude Code and Codex options\n- [ ] Provider dropdown in Send to Dev dialog\n- [ ] Provider dropdown in Agent Review dialog\n- [ ] Codex option disabled with 'Configure API key in Settings' tooltip when no key set\n- [ ] Selected provider passed to respective API routes in request body\n- [ ] Claude Code is the default selection\n- [ ] Provider selection persists within the session (remembers last choice)",
          "status": "review",
          "position": 7
        },
        {
          "id": "PrbrYqPg2uRu",
          "title": "As a developer, I want a provider toggle in the chat header so that I can choose between Claude Code and Codex for brainstorming conversations",
          "description": "Add a provider toggle (Claude Code / Codex) in the chat panel header. The toggle is enabled when creating a new conversation and becomes disabled/locked after the first message is sent. The selected provider is stored with the conversation and used for all subsequent messages in that thread.",
          "acceptance_criteria": "- [ ] Provider toggle rendered in chat panel header\n- [ ] Toggle enabled before any messages are sent in the conversation\n- [ ] Toggle disabled/locked after the first message (provider immutable per conversation)\n- [ ] Selected provider stored in database with the conversation\n- [ ] All messages in the conversation use the locked provider\n- [ ] Visual indicator shows which provider is active (icon or label)\n- [ ] Codex option disabled if no API key configured",
          "status": "review",
          "position": 8
        },
        {
          "id": "5kPIdvZ0aIWc",
          "title": "As a developer, I want a Codex API key field in Settings so that I can configure the Codex provider",
          "description": "Add a 'Codex API Key' input field to the Settings page. The key is stored in the `settings` table with key `codex_api_key`. The field uses a password-type input with show/hide toggle. Validate that the key is non-empty on save. The key is read by the Codex provider when spawning sessions.",
          "acceptance_criteria": "- [ ] 'Codex API Key' field added to Settings page\n- [ ] Password-type input with show/hide toggle\n- [ ] Key stored in `settings` table with key `codex_api_key`\n- [ ] Save button with loading state and success/error feedback\n- [ ] Non-empty validation on save\n- [ ] Existing settings (global prompt) unaffected\n- [ ] Codex provider reads key from settings table on session spawn",
          "status": "review",
          "position": 9
        }
      ]
    },
    {
      "id": "R9H1_aAgudez",
      "title": "Ticket Comments, Send-to-Dev & Agent Review",
      "description": "Add a comment system to user stories (tickets), a dedicated story detail page replacing the sheet, and review workflows powered by Claude Code agents.\n\n## Implementation Plan\n\n### Phase 1 — Schema & Data Layer\n- Add `ticketComments` table (id, userStoryId, author: 'user'|'agent', content, agentSessionId?, createdAt)\n- Add `userStoryId` column to `agentSessions` to link agent work back to a specific ticket\n- Add `\"review\"` as a valid status for user stories (todo → in_progress → review → done)\n\n### Phase 2 — API Routes\n- `GET/PATCH /api/projects/[projectId]/stories/[storyId]` — fetch & update story detail\n- `GET/POST /api/projects/[projectId]/stories/[storyId]/comments` — list & add comments\n- `POST /api/projects/[projectId]/stories/[storyId]/build` — dispatch a code-mode agent for the ticket (send-to-dev)\n- `POST /api/projects/[projectId]/stories/[storyId]/review` — dispatch review agents (security, code-review, compliance/accessibility)\n\n### Phase 3 — Hooks\n- `useStoryDetail` — fetch story with epic context\n- `useComments` — fetch comments with 5s polling\n- `useTicketAgent` — dispatch agent + poll session status, auto-post final output as agent comment\n\n### Phase 4 — Story Detail Page\n- New route: `/projects/[projectId]/stories/[storyId]`\n- Two-column layout: left = story details (title, description, acceptance criteria, status, priority), right = comment thread\n- Navigate to this page by clicking story titles in the epic detail view\n\n### Phase 5 — Send to Dev\n- Available on tickets in `todo` or `in_progress` status\n- \"Send to Dev\" button opens a dialog with an optional comment field\n- On confirm: post comment (if provided), dispatch code-mode agent with ticket context + full comment history, move ticket to `in_progress`\n- Agent reuses the epic's existing git worktree/branch with concurrency guard\n\n### Phase 6 — Agent Review (Review status)\n- Available on tickets in `review` status\n- \"Send to Dev\" button (requires mandatory comment explaining what to fix) → dispatches code agent, moves ticket back to `in_progress`\n- \"Agent Review\" button opens dialog with 3 checkboxes: Security, Code Review, Compliance/Accessibility\n- Each selected review type dispatches a separate agent in plan mode with a specialized review checklist\n- Agent outputs are posted as comments on the ticket\n\n### Phase 7 — Approve & Merge\n- \"Approve\" action on review-status tickets marks the ticket as `done`\n- Triggers merge of the epic's worktree branch into the target branch\n\n### Prompt Builder\n- `buildTicketBuildPrompt` — code mode, includes project spec, epic context, ticket details, and full comment history\n- `buildReviewPrompt` — plan mode, 3 specialized checklists (security audit, code review best practices, compliance/accessibility standards)",
      "priority": 0,
      "status": "done",
      "position": 36,
      "branchName": null,
      "user_stories": [
        {
          "id": "pNQZ8pdzWkb6",
          "title": "As a developer, I want a comments table in the database so that ticket comments are persisted and queryable",
          "description": "Add a `ticketComments` table to the Drizzle schema with fields: id, userStoryId (FK), author ('user'|'agent'), content, agentSessionId (nullable FK), createdAt. Add `userStoryId` column to `agentSessions`. Add 'review' as a valid user story status.",
          "acceptance_criteria": "- [ ] `ticketComments` table created in `lib/db/schema.ts` with proper foreign keys and cascade deletes\n- [ ] `userStoryId` column added to `agentSessions` table referencing `userStories.id`\n- [ ] User story status now supports 'review' in addition to 'todo', 'in_progress', 'done'\n- [ ] Drizzle migration generated and pushed successfully\n- [ ] Types updated in `lib/types/kanban.ts` if needed",
          "status": "done",
          "position": 0
        },
        {
          "id": "4XcxMBMK3qjZ",
          "title": "As a developer, I want API routes for story detail and comments so that the frontend can fetch and manage ticket data",
          "description": "Create API routes: GET/PATCH for story detail at `/api/projects/[projectId]/stories/[storyId]`, and GET/POST for comments at `/api/projects/[projectId]/stories/[storyId]/comments`. GET story returns story with epic context. POST comment accepts author and content fields.",
          "acceptance_criteria": "- [ ] `GET /api/projects/[projectId]/stories/[storyId]` returns story with parent epic info\n- [ ] `PATCH /api/projects/[projectId]/stories/[storyId]` updates story fields (title, description, status, acceptance_criteria)\n- [ ] `GET /api/projects/[projectId]/stories/[storyId]/comments` returns comments ordered by createdAt ascending\n- [ ] `POST /api/projects/[projectId]/stories/[storyId]/comments` creates a comment with author and content\n- [ ] Consistent `{ data }` / `{ error }` response shape\n- [ ] 404 handling for missing stories",
          "status": "done",
          "position": 1
        },
        {
          "id": "o8UBfdmF12O4",
          "title": "As a developer, I want a story detail page so that I can view and manage a ticket with its full comment thread",
          "description": "Create a new page at `app/projects/[projectId]/stories/[storyId]/page.tsx` with a two-column layout. Left column shows story details (title, description, acceptance criteria, status badge, priority). Right column shows the comment thread with input field. Replace the current sheet-based story view with navigation to this page.",
          "acceptance_criteria": "- [ ] Page route `/projects/[projectId]/stories/[storyId]` renders correctly\n- [ ] Left column displays editable story title, description, acceptance criteria\n- [ ] Status badge and priority displayed with color coding\n- [ ] Right column shows scrollable comment thread with author labels and timestamps\n- [ ] Comment input field with submit button at the bottom\n- [ ] User can add comments that appear immediately (optimistic UI)\n- [ ] Comments poll every 5 seconds for new entries\n- [ ] Clicking a story title in the epic detail view navigates to this page",
          "status": "done",
          "position": 2
        },
        {
          "id": "HR-nFFQELWqr",
          "title": "As a developer, I want hooks for story detail and comments so that the UI stays in sync with the backend",
          "description": "Create `useStoryDetail` hook (fetches story with epic context, supports mutation), `useComments` hook (fetches comments with 5s polling interval, supports adding comments), and `useTicketAgent` hook (dispatches agent, polls session status, auto-posts agent output as comment when done).",
          "acceptance_criteria": "- [ ] `useStoryDetail` hook fetches and caches story data, provides update function\n- [ ] `useComments` hook returns comments array, polls every 5s, provides addComment function\n- [ ] `useTicketAgent` hook dispatches build/review agents via API, tracks session status\n- [ ] Agent output is automatically posted as an 'agent' comment when session completes\n- [ ] Loading and error states handled in all hooks",
          "status": "done",
          "position": 3
        },
        {
          "id": "FYfgayRe59Ec",
          "title": "As a developer, I want to send a ticket to dev so that Claude Code implements the ticket in the epic's worktree",
          "description": "Add a 'Send to Dev' action for tickets in `todo` or `in_progress` status. Opens a dialog with an optional comment field. On confirm: posts comment if provided, dispatches a code-mode Claude Code agent with the ticket context and full comment history, and moves the ticket to `in_progress`. Reuses the epic's existing git worktree/branch with a concurrency guard preventing parallel code-mode builds on the same epic.",
          "acceptance_criteria": "- [ ] 'Send to Dev' button visible on story detail page for todo/in_progress tickets\n- [ ] Dialog opens with optional comment textarea\n- [ ] Comment posted before agent dispatch if provided\n- [ ] `POST /api/projects/[projectId]/stories/[storyId]/build` dispatches code-mode agent\n- [ ] Agent prompt includes project spec, epic context, ticket details, and all comments\n- [ ] Ticket status moves to `in_progress` on dispatch\n- [ ] Agent reuses epic's existing worktree and branch\n- [ ] Concurrency guard prevents parallel code-mode builds on the same epic\n- [ ] Agent final output posted as 'agent' comment when session completes",
          "status": "done",
          "position": 4
        },
        {
          "id": "IbruFprMyXPQ",
          "title": "As a developer, I want to send a review-status ticket back to dev with a mandatory comment so that Claude Code can address my feedback",
          "description": "For tickets in `review` status, add a 'Send to Dev' action that requires a mandatory comment explaining what needs to be fixed. On confirm: posts the comment, dispatches a code-mode agent with the full comment history (including the new feedback), and moves the ticket back to `in_progress`.",
          "acceptance_criteria": "- [ ] 'Send to Dev' button visible on story detail page for review-status tickets\n- [ ] Dialog opens with mandatory comment textarea (submit disabled when empty)\n- [ ] Comment posted before agent dispatch\n- [ ] Code-mode agent dispatched with full comment history including the new feedback\n- [ ] Ticket status moves from `review` to `in_progress`\n- [ ] Same concurrency guard and worktree reuse as the standard send-to-dev flow",
          "status": "done",
          "position": 5
        },
        {
          "id": "gF5M3UOTaShZ",
          "title": "As a developer, I want to trigger agent reviews on review-status tickets so that Claude Code checks security, code quality, and compliance",
          "description": "For tickets in `review` status, add an 'Agent Review' button that opens a dialog with 3 checkboxes: Security, Code Review, Compliance/Accessibility. Each selected review type dispatches a separate Claude Code agent in plan mode with a specialized review checklist. Each agent's output is posted as a separate 'agent' comment on the ticket.",
          "acceptance_criteria": "- [ ] 'Agent Review' button visible on story detail page for review-status tickets\n- [ ] Dialog with 3 checkboxes: Security, Code Review, Compliance/Accessibility\n- [ ] At least one checkbox must be selected to submit\n- [ ] `POST /api/projects/[projectId]/stories/[storyId]/review` accepts array of review types\n- [ ] Each selected type dispatches a separate plan-mode agent with specialized prompt\n- [ ] Security review checks: OWASP top 10, input validation, auth/authz, secrets exposure\n- [ ] Code review checks: readability, DRY, error handling, performance, naming conventions\n- [ ] Compliance review checks: WCAG accessibility, i18n readiness, license compliance\n- [ ] Each agent's output posted as a separate 'agent' comment with review type label",
          "status": "done",
          "position": 6
        },
        {
          "id": "bQ_aglUKuaPp",
          "title": "As a developer, I want to approve a review-status ticket so that it is marked done and the branch is merged",
          "description": "Add an 'Approve' action on review-status tickets that marks the ticket as `done`. Optionally triggers a merge of the epic's worktree branch into the target branch if all stories in the epic are done.",
          "acceptance_criteria": "- [ ] 'Approve' button visible on story detail page for review-status tickets\n- [ ] Clicking 'Approve' moves ticket status from `review` to `done`\n- [ ] If all stories in the parent epic are now `done`, epic status is also updated\n- [ ] Branch merge triggered when epic is fully complete (all stories done)\n- [ ] Success/error feedback displayed to the user",
          "status": "done",
          "position": 7
        }
      ]
    },
    {
      "id": "lJL18nXj0nwh",
      "title": "Release Management",
      "description": "Create releases by selecting completed epics, generate changelogs via Claude Code, create git tags, and maintain release history.",
      "priority": 0,
      "status": "done",
      "position": 37,
      "branchName": null,
      "user_stories": [
        {
          "id": "p5_Wvw87OH32",
          "title": "Create a release with selected epics",
          "description": "As a developer, I want to create a release by selecting completed epics and specifying a version, so that I can track what's included in each release.",
          "acceptance_criteria": "- [x] Release creation dialog with version and title\n- [x] Epic selection (filters to done/review status)\n- [x] Release persisted with epic IDs\n- [x] Release list display\n- [ ] Tests",
          "status": "in_progress",
          "position": 0
        },
        {
          "id": "p4-P_qfndpqp",
          "title": "Generate changelog automatically",
          "description": "As a developer, I want to auto-generate a changelog using Claude Code based on the selected epics, so that I save time writing release notes.",
          "acceptance_criteria": "- [x] Toggle to enable changelog generation\n- [x] Claude Code plan mode generates changelog\n- [x] Fallback auto-generated changelog if Claude fails\n- [x] Changelog displayed on release card\n- [ ] Tests",
          "status": "in_progress",
          "position": 1
        },
        {
          "id": "80PMFB5tXPCv",
          "title": "Create git tags for releases",
          "description": "As a developer, I want a git tag to be created when I make a release, so that the release is tracked in version control.",
          "acceptance_criteria": "- [x] Git tag created with version string\n- [x] Tag name stored in DB\n- [x] Tag displayed on release card\n- [x] Graceful handling if git repo not configured\n- [ ] Tests",
          "status": "in_progress",
          "position": 2
        }
      ]
    },
    {
      "id": "sIweK-FyXnSy",
      "title": "Chat Image Upload & Clipboard Paste",
      "description": "Add image support to chat panels — users can upload images via a file picker or paste them from the clipboard. Images are saved locally, displayed as thumbnails before sending, and rendered inline in chat messages.\n\n## Implementation Plan\n\n### Phase 1 — Storage & Schema\n- Create `data/uploads/` directory for storing chat image files (gitignored)\n- Add `chatAttachments` table to Drizzle schema (id, chatMessageId FK, fileName, filePath, mimeType, sizeBytes, createdAt)\n- Add cascade delete from chatMessages to chatAttachments\n- Generate and push migration\n\n### Phase 2 — Upload API\n- Create `POST /api/projects/[projectId]/chat/upload` route\n- Accept multipart form data with image files (png, jpg, jpeg, gif, webp)\n- Validate file type and size (max 10MB per file)\n- Save files to `data/uploads/{projectId}/{nanoid}-{originalName}`\n- Return attachment metadata (id, fileName, filePath, mimeType)\n- Create `GET /api/projects/[projectId]/chat/uploads/[attachmentId]` to serve images\n\n### Phase 3 — Enhanced MessageInput Component\n- Add paste event handler on the textarea to intercept `clipboardData.items` with `type.startsWith('image/')`\n- Convert pasted image blobs to File objects and upload immediately\n- Add image upload button (paperclip/image icon) next to the send button\n- Hidden file input accepting image MIME types, triggered by the button\n- Display pending image thumbnails in a preview strip above the textarea\n- Allow removing individual thumbnails before sending\n- On send, include attachment IDs alongside the message content\n\n### Phase 4 — Message Rendering\n- Update MessageList / MarkdownContent to detect and render images associated with messages\n- Fetch attachments for each message and display them as inline images below the text\n- Support lightbox/modal view on image click for full-size viewing\n- Lazy-load images with placeholder skeleton\n\n### Phase 5 — Chat API Integration\n- Update `POST /api/projects/[projectId]/chat/messages` to accept an optional `attachmentIds` array\n- Link uploaded attachments to the created message\n- Update `GET /api/projects/[projectId]/chat/messages` to include attachment metadata in response\n- Ensure attachments are cleaned up when messages are deleted (cascade)",
      "priority": 0,
      "status": "done",
      "position": 38,
      "branchName": null,
      "user_stories": [
        {
          "id": "EIHCDvsUMuCI",
          "title": "As a user, I want a chatAttachments table so that uploaded images are persisted and linked to chat messages",
          "description": "Add a `chatAttachments` table to the Drizzle schema with fields: id (nanoid), chatMessageId (FK to chatMessages, nullable for pending uploads), fileName, filePath, mimeType, sizeBytes, createdAt. Set up cascade deletes from chatMessages. Ensure the `data/uploads/` directory is gitignored.",
          "acceptance_criteria": "- [ ] `chatAttachments` table added to `lib/db/schema.ts` with proper fields and types\n- [ ] Foreign key to `chatMessages` with cascade delete\n- [ ] `chatMessageId` is nullable to support pre-send uploads\n- [ ] Drizzle migration generated and pushed successfully\n- [ ] `data/uploads/` directory is gitignored\n- [ ] TypeScript types exported for chatAttachments",
          "status": "done",
          "position": 0
        },
        {
          "id": "Z_h0L5J5kyJQ",
          "title": "As a user, I want an upload API endpoint so that images can be saved to the server and served back",
          "description": "Create `POST /api/projects/[projectId]/chat/upload` to accept multipart image uploads (png, jpg, jpeg, gif, webp). Validate MIME type and file size (max 10MB). Save to `data/uploads/{projectId}/{nanoid}-{originalName}`. Return attachment metadata. Create `GET /api/projects/[projectId]/chat/uploads/[attachmentId]` to serve the image file with correct Content-Type.",
          "acceptance_criteria": "- [ ] POST endpoint accepts multipart form data with image files\n- [ ] Only image MIME types accepted (png, jpg, jpeg, gif, webp)\n- [ ] File size validated (max 10MB per file)\n- [ ] Files saved to `data/uploads/{projectId}/{nanoid}-{originalName}`\n- [ ] Attachment record created in `chatAttachments` table with null chatMessageId\n- [ ] Response returns `{ data: { id, fileName, filePath, mimeType, sizeBytes } }`\n- [ ] GET endpoint serves the image file with correct Content-Type header\n- [ ] 404 returned for missing attachments",
          "status": "done",
          "position": 1
        },
        {
          "id": "rxFPi0Z67DeV",
          "title": "As a user, I want to paste images from my clipboard into the chat input so that I can quickly share screenshots",
          "description": "Add a paste event handler on the MessageInput textarea that intercepts `clipboardData.items` with image MIME types. Convert pasted blobs to File objects and immediately upload them via the upload API. Show the uploaded image as a thumbnail in a preview strip above the textarea. Support pasting multiple images.",
          "acceptance_criteria": "- [ ] Paste event handler on textarea intercepts image data from clipboard\n- [ ] Pasted image blobs converted to File objects with generated filenames\n- [ ] Images uploaded automatically via POST to the upload API\n- [ ] Upload progress/loading indicator shown during upload\n- [ ] Uploaded images appear as thumbnails in a preview strip above the textarea\n- [ ] Multiple pasted images supported (accumulate in preview strip)\n- [ ] Text paste behavior unaffected when clipboard contains no images",
          "status": "done",
          "position": 2
        },
        {
          "id": "LyfCHYhzZWEN",
          "title": "As a user, I want an image upload button in the chat input so that I can attach images from my filesystem",
          "description": "Add an image/paperclip icon button next to the send button in MessageInput. Clicking it opens a hidden file input accepting image MIME types (png, jpg, jpeg, gif, webp). Selected files are uploaded via the upload API and displayed as thumbnails in the same preview strip used for pasted images. Allow removing individual thumbnails before sending.",
          "acceptance_criteria": "- [ ] Image upload button (paperclip or image icon) rendered next to the send button\n- [ ] Hidden file input triggered on button click, accepting image/* MIME types\n- [ ] Selected files uploaded via the upload API\n- [ ] Uploaded images displayed as thumbnails in preview strip above textarea\n- [ ] Each thumbnail has a remove/X button to discard before sending\n- [ ] Multiple files can be selected at once\n- [ ] Button disabled during active uploads with loading state",
          "status": "done",
          "position": 3
        },
        {
          "id": "W-D318O-H6k2",
          "title": "As a user, I want chat messages to include attached images so that sent images are linked to my message",
          "description": "Update the chat message send flow and API to support attachments. The POST message endpoint accepts an optional `attachmentIds` array. On send, link pending attachments to the created message by updating their `chatMessageId`. The GET messages endpoint includes attachment metadata in the response. Clean up orphaned attachments periodically.",
          "acceptance_criteria": "- [ ] `POST /api/projects/[projectId]/chat/messages` accepts optional `attachmentIds` array\n- [ ] Pending attachments updated with the new message's ID on send\n- [ ] `GET /api/projects/[projectId]/chat/messages` includes `attachments` array in each message\n- [ ] Attachment metadata includes id, fileName, mimeType, and URL to serve the image\n- [ ] Orphaned attachments (never linked to a message) cleaned up after 24 hours\n- [ ] Cascade delete removes attachments when messages are deleted",
          "status": "done",
          "position": 4
        },
        {
          "id": "ko-wf5dbnfgx",
          "title": "As a user, I want to see images rendered inline in chat messages so that shared screenshots are visible in the conversation",
          "description": "Update the MessageList and MarkdownContent components to render attached images inline below the message text. Images are loaded from the serve endpoint. Support click-to-enlarge with a lightbox/modal overlay for full-size viewing. Lazy-load images with a skeleton placeholder to avoid layout shift.",
          "acceptance_criteria": "- [ ] Images rendered inline below message text in the chat thread\n- [ ] Images loaded from the GET serve endpoint with correct aspect ratio\n- [ ] Clicking an image opens a lightbox/modal with the full-size image\n- [ ] Modal closes on click outside, Escape key, or close button\n- [ ] Images lazy-loaded with skeleton placeholder\n- [ ] Multiple images per message displayed in a grid or row layout\n- [ ] Alt text set to the original filename for accessibility",
          "status": "done",
          "position": 5
        }
      ]
    },
    {
      "id": "c170Zvt1JTYW",
      "title": "Markdown Rendering",
      "description": "Render Markdown content as styled HTML in the document viewer and spec preview components.",
      "priority": 0,
      "status": "done",
      "position": 39,
      "branchName": null,
      "user_stories": [
        {
          "id": "pkBUfMJKM5AM",
          "title": "Render Markdown in document viewer",
          "description": "As a developer, I want uploaded documents to be displayed as rendered Markdown with proper formatting, so that I can easily read the content.",
          "acceptance_criteria": "- [x] Markdown-to-HTML utility exists (lib/utils/markdown.ts)\n- [x] Dependencies installed (remark, rehype, sanitize)\n- [ ] DocumentViewer uses rendered HTML instead of raw text\n- [ ] Prose styling applied\n- [ ] Tests",
          "status": "in_progress",
          "position": 0
        },
        {
          "id": "aZPKOfA2mI6D",
          "title": "Render Markdown in spec preview",
          "description": "As a developer, I want the spec preview to show rendered Markdown, so that I can see formatted output while editing.",
          "acceptance_criteria": "- [x] Markdown-to-HTML utility exists\n- [ ] SpecPreview uses rendered HTML instead of raw text\n- [ ] Prose styling applied\n- [ ] Tests",
          "status": "in_progress",
          "position": 1
        }
      ]
    },
    {
      "id": "BNRAJDy0oyhj",
      "title": "Tests & Preview Integration (V2)",
      "description": "Automatic test detection/execution and dev server preview within Arij, as planned for V2.",
      "priority": 0,
      "status": "done",
      "position": 40,
      "branchName": null,
      "user_stories": [
        {
          "id": "xvVmjUedBcHX",
          "title": "Run project tests from Arij",
          "description": "As a developer, I want to run my project's tests from within Arij, so that I can verify Claude Code's work.",
          "acceptance_criteria": "- [ ] Framework detection (Next.js, Vite, etc.)\n- [ ] 'Run Tests' button\n- [ ] Test output display\n- [ ] Test report in epic view",
          "status": "todo",
          "position": 0
        },
        {
          "id": "uV8sdzs4Z5qG",
          "title": "Preview project in iframe",
          "description": "As a developer, I want to preview my project's dev server in an iframe within Arij, so that I can see results without switching context.",
          "acceptance_criteria": "- [ ] Launch dev server\n- [ ] Iframe preview display\n- [ ] URL configuration",
          "status": "todo",
          "position": 1
        }
      ]
    },
    {
      "id": "ye5iGELailQl",
      "title": "Global Settings",
      "description": "Application-wide settings including a global prompt injected into all Claude Code sessions.",
      "priority": 0,
      "status": "done",
      "position": 41,
      "branchName": null,
      "user_stories": [
        {
          "id": "jUi5DrZpvlPY",
          "title": "Configure global prompt for Claude Code",
          "description": "As a developer, I want to set a global prompt that is injected into all Claude Code sessions, so that I can customize AI behavior across all projects.",
          "acceptance_criteria": "- [x] Settings page with global prompt textarea\n- [x] Save button with loading state\n- [x] Persisted in DB settings table\n- [x] Injected into all Claude Code prompts\n- [ ] Tests",
          "status": "in_progress",
          "position": 0
        }
      ]
    },
    {
      "id": "nDCe40SC17-K",
      "title": "Chat Brainstorm with Claude Code",
      "description": "Chat panel integrated into project views, using Claude Code in plan mode for brainstorming, ideation, and project refinement.",
      "priority": 0,
      "status": "done",
      "position": 42,
      "branchName": null,
      "user_stories": [
        {
          "id": "Dgh62xQ3RtOU",
          "title": "Send and receive chat messages",
          "description": "As a developer, I want to chat with Claude Code about my project ideas, so that I can brainstorm and refine my project vision.",
          "acceptance_criteria": "- [x] Message input with enter-to-send\n- [x] Optimistic UI (message appears immediately)\n- [x] Claude Code responds in plan mode\n- [x] Message history persisted in DB\n- [x] Rollback on error\n- [ ] Streaming responses (currently waits for full response)\n- [ ] Tests",
          "status": "done",
          "position": 0
        },
        {
          "id": "LN1XzpZ1tGhC",
          "title": "Context-aware chat with project documents",
          "description": "As a developer, I want the chat to include my project description, uploaded documents, and existing spec as context, so that Claude Code gives relevant answers.",
          "acceptance_criteria": "- [x] Project description injected\n- [x] All documents injected as markdown\n- [x] Existing spec injected\n- [x] Recent chat history (20 messages) included\n- [ ] Tests for prompt building",
          "status": "in_progress",
          "position": 1
        },
        {
          "id": "T7r1nesxfl13",
          "title": "Toggle chat panel in project view",
          "description": "As a developer, I want to show/hide the chat panel while working on my project, so that I can focus on the kanban or chat as needed.",
          "acceptance_criteria": "- [x] Toggle button in project header\n- [x] Chat panel appears on right side\n- [x] Panel collapses when toggled off\n- [ ] Tests",
          "status": "in_progress",
          "position": 2
        }
      ]
    },
    {
      "id": "-Qos9lRkRw16",
      "title": "Document Upload & Conversion",
      "description": "Upload project documents (PDF, DOCX, Markdown, plain text), convert them to Markdown, and store them as project context for Claude Code sessions.",
      "priority": 0,
      "status": "done",
      "position": 43,
      "branchName": null,
      "user_stories": [
        {
          "id": "GaLkK6WiXMSh",
          "title": "Upload documents via drag-and-drop",
          "description": "As a developer, I want to drag and drop files into a project to upload them, so that I can easily add context documents.",
          "acceptance_criteria": "- [x] Drag-and-drop zone with visual feedback\n- [x] File input accepts .pdf, .docx, .md, .txt\n- [x] Upload progress indicator\n- [x] Multiple file support\n- [x] API stores file with converted markdown\n- [ ] Tests",
          "status": "in_progress",
          "position": 0
        },
        {
          "id": "ynKMcLHRwvCi",
          "title": "Convert uploaded files to Markdown",
          "description": "As a developer, I want uploaded PDF and DOCX files to be automatically converted to Markdown, so that they can be used as context for Claude Code.",
          "acceptance_criteria": "- [x] PDF to Markdown conversion\n- [x] DOCX to Markdown conversion\n- [x] Markdown and plain text passthrough\n- [ ] Image OCR support (.png, .jpg)\n- [ ] Tests for converter functions",
          "status": "in_progress",
          "position": 1
        },
        {
          "id": "xLMe0scBKdH6",
          "title": "View uploaded documents",
          "description": "As a developer, I want to view the converted Markdown content of uploaded documents, so that I can verify the conversion quality.",
          "acceptance_criteria": "- [x] Document list sidebar\n- [x] Document selection with visual highlight\n- [x] Document content display\n- [ ] Rendered Markdown display (currently shows raw text)\n- [ ] Tests",
          "status": "in_progress",
          "position": 2
        }
      ]
    },
    {
      "id": "u66Q5mh6UFF1",
      "title": "Session Management & Monitoring",
      "description": "Track and monitor Claude Code agent sessions with real-time status updates, detailed logs, and session lifecycle management.",
      "priority": 0,
      "status": "done",
      "position": 44,
      "branchName": null,
      "user_stories": [
        {
          "id": "FbHQtOuk6EVL",
          "title": "View session list with status indicators",
          "description": "As a developer, I want to see a list of all build sessions with their status, duration, and mode, so that I can track build history.",
          "acceptance_criteria": "- [x] Session cards with status icons and color coding\n- [x] Duration calculation\n- [x] Mode display (plan/code)\n- [x] Branch name display\n- [x] Error message truncation\n- [x] Running session count\n- [x] Link to session detail\n- [ ] Tests",
          "status": "in_progress",
          "position": 0
        },
        {
          "id": "OfjJFzoiPR5Y",
          "title": "View detailed session information and logs",
          "description": "As a developer, I want to view the full details of a build session including the prompt sent, response received, and raw logs, so that I can debug issues.",
          "acceptance_criteria": "- [x] Three-tab interface: Response, Prompt, Raw Logs\n- [x] Status badge and metadata display\n- [x] Auto-polling while session is running\n- [x] Cancel button for running sessions\n- [x] Export logs as JSON\n- [x] Filesystem log loading\n- [ ] Tests",
          "status": "in_progress",
          "position": 1
        },
        {
          "id": "c5_ZTSXPr1Q3",
          "title": "Monitor active agents in real-time",
          "description": "As a developer, I want to see active Claude Code agents with elapsed time in a monitor bar, so that I know what's running.",
          "acceptance_criteria": "- [x] Collapsible panel showing active sessions\n- [x] Per-session elapsed time updating every second\n- [x] Stop/Cancel button per session\n- [x] Green indicator animation\n- [x] Auto-hide when no active sessions\n- [ ] Tests",
          "status": "in_progress",
          "position": 2
        }
      ]
    },
    {
      "id": "hxwJ1ko1tOt1",
      "title": "NPM Package & CLI Distribution",
      "description": "Publish Arij as an npm package with a CLI entry point so users can run it with `npx arij`.",
      "priority": 0,
      "status": "done",
      "position": 45,
      "branchName": null,
      "user_stories": [
        {
          "id": "GQ0ZJAYY0eVX",
          "title": "Create CLI entry point",
          "description": "As a developer, I want to run `npx arij` to start the application, so that setup is minimal.",
          "acceptance_criteria": "- [ ] bin field added to package.json\n- [ ] CLI entry script created\n- [ ] Package name set to 'arij'\n- [ ] Start command launches Next.js server",
          "status": "todo",
          "position": 0
        }
      ]
    },
    {
      "id": "V8iQZQTKaP4j",
      "title": "Testing Infrastructure",
      "description": "Unit tests with Vitest and E2E tests with Playwright as specified in the tech stack.",
      "priority": 0,
      "status": "done",
      "position": 46,
      "branchName": null,
      "user_stories": [
        {
          "id": "eU0fN58nLwRd",
          "title": "Set up Vitest for unit testing",
          "description": "As a developer, I want Vitest configured for unit testing, so that I can write and run tests for utilities, API routes, and hooks.",
          "acceptance_criteria": "- [ ] Vitest installed and configured\n- [ ] vitest.config.ts created\n- [ ] Test script added to package.json\n- [ ] Sample tests for critical utilities",
          "status": "todo",
          "position": 0
        },
        {
          "id": "0USKh3TzJPFt",
          "title": "Set up Playwright for E2E testing",
          "description": "As a developer, I want Playwright configured for end-to-end testing, so that I can test user workflows in the browser.",
          "acceptance_criteria": "- [ ] Playwright installed and configured\n- [ ] playwright.config.ts created\n- [ ] E2E test scripts added\n- [ ] Sample E2E test for core workflow",
          "status": "todo",
          "position": 1
        }
      ]
    },
    {
      "id": "zCgJ2YUrZOeh",
      "title": "Project CRUD & Dashboard",
      "description": "Multi-project dashboard with project creation, listing, filtering, and detail views. Core project management lifecycle including archiving.",
      "priority": 0,
      "status": "done",
      "position": 47,
      "branchName": null,
      "user_stories": [
        {
          "id": "WWqmNCZLHOuT",
          "title": "Create a new project",
          "description": "As a developer, I want to create a new project with a name, optional description, and optional git repo path, so that I can start organizing my work.",
          "acceptance_criteria": "- [x] Form with required name, optional description, optional git repo path\n- [x] Validation prevents empty name submission\n- [x] Project created in DB with nanoid ID and 'ideation' status\n- [x] Redirect to project detail page on success\n- [ ] Unit tests for project creation API",
          "status": "in_progress",
          "position": 0
        },
        {
          "id": "XJPv6N5se99e",
          "title": "View all projects on dashboard",
          "description": "As a developer, I want to see all my projects on a dashboard with progress indicators, so that I can track multi-project status at a glance.",
          "acceptance_criteria": "- [x] Grid layout with responsive columns (1-4)\n- [x] Each card shows name, description, progress bar, active agents, last activity\n- [x] Filter by All / Active / Archived\n- [x] Empty state with action buttons\n- [ ] Unit tests for project listing API\n- [ ] E2E test for dashboard rendering",
          "status": "in_progress",
          "position": 1
        },
        {
          "id": "PuSpsfU-d3xl",
          "title": "Edit and delete projects",
          "description": "As a developer, I want to edit project details or delete a project, so that I can keep my workspace organized.",
          "acceptance_criteria": "- [x] PATCH endpoint updates name, description, status, gitRepoPath, spec\n- [x] DELETE endpoint removes project\n- [x] 404 handling for missing projects\n- [ ] Unit tests for update/delete API",
          "status": "in_progress",
          "position": 2
        }
      ]
    },
    {
      "id": "khLBAcsZ0nY6",
      "title": "Database & ORM Layer",
      "description": "SQLite database with Drizzle ORM schema, migrations, and connection management.",
      "priority": 0,
      "status": "done",
      "position": 48,
      "branchName": null,
      "user_stories": [
        {
          "id": "xUPxrm4vky-G",
          "title": "Define database schema",
          "description": "As a developer, I want a well-structured database schema covering all project entities, so that the application can persist and query data efficiently.",
          "acceptance_criteria": "- [x] 8 tables: projects, documents, epics, userStories, chatMessages, agentSessions, releases, settings\n- [x] Proper field types and defaults\n- [x] Cascade deletes where appropriate\n- [x] Position fields for ordering\n- [x] Drizzle config for migrations\n- [ ] Generated migration files\n- [ ] Tests",
          "status": "in_progress",
          "position": 0
        }
      ]
    },
    {
      "id": "MzPdBGtz4Rce",
      "title": "Spec Generation & Editing",
      "description": "Generate project specifications with epics and user stories using Claude Code in plan mode. Edit specs in a Markdown editor with preview.",
      "priority": 0,
      "status": "done",
      "position": 49,
      "branchName": null,
      "user_stories": [
        {
          "id": "Bosm0rMgspeL",
          "title": "Generate spec and plan from project context",
          "description": "As a developer, I want to generate a structured project spec with epics and user stories using Claude Code, so that I can quickly plan my project.",
          "acceptance_criteria": "- [x] 'Generate Spec & Plan' button in chat panel\n- [x] Claude Code spawned in plan mode with structured prompt\n- [x] JSON output parsed to extract spec, epics, and user stories\n- [x] Epics and user stories bulk-inserted into database\n- [x] Project status updated to 'specifying'\n- [x] Fallback to plain text spec if JSON parsing fails\n- [ ] Tests",
          "status": "in_progress",
          "position": 0
        },
        {
          "id": "TtUNrEGC9BwG",
          "title": "Edit project spec in Markdown editor",
          "description": "As a developer, I want to manually edit the generated spec in a Markdown editor, so that I can refine it to my needs.",
          "acceptance_criteria": "- [x] Tab interface for Edit and Preview modes\n- [x] Textarea editor with monospace font\n- [x] Save button with loading state\n- [x] API persistence\n- [ ] Rendered Markdown preview (currently raw text)\n- [ ] Tests",
          "status": "in_progress",
          "position": 1
        }
      ]
    },
    {
      "id": "ul3ekR8gDU5L",
      "title": "Claude Code Build Integration",
      "description": "Launch Claude Code in code mode to implement epics. Create git worktrees and branches per epic, compose structured prompts, manage build sessions.",
      "priority": 0,
      "status": "done",
      "position": 50,
      "branchName": null,
      "user_stories": [
        {
          "id": "vOsq7c4JLt7k",
          "title": "Launch Claude Code build for selected epics",
          "description": "As a developer, I want to click 'Build with Claude Code' to launch code generation for selected epics, so that Claude implements my specs.",
          "acceptance_criteria": "- [x] Build button triggers API call with selected epic IDs\n- [x] Parallel and sequential build mode options\n- [x] Git worktree + branch created per epic\n- [x] Claude Code spawned in code mode with structured prompt\n- [x] Epic status moves to 'In Progress' automatically\n- [ ] Tests",
          "status": "in_progress",
          "position": 0
        },
        {
          "id": "--srpKufUNTw",
          "title": "Compose structured build prompts",
          "description": "As a developer, I want Claude Code to receive a prompt containing my project spec, documents, and epic details, so that it has full context for implementation.",
          "acceptance_criteria": "- [x] Global prompt from settings injected\n- [x] Project spec included\n- [x] All project documents included as markdown\n- [x] Target epic title, description, and user stories with acceptance criteria\n- [x] Build instructions appended\n- [ ] Tests for prompt composition",
          "status": "in_progress",
          "position": 1
        },
        {
          "id": "8Ey0khPFFVY3",
          "title": "Manage concurrent build sessions",
          "description": "As a developer, I want the system to track running Claude Code processes and allow me to cancel them, so that I have control over active builds.",
          "acceptance_criteria": "- [x] Singleton process manager tracks all sessions\n- [x] Start, cancel, status, listActive, listAll operations\n- [x] Graceful kill with SIGTERM→SIGKILL fallback (5s timeout)\n- [x] Session status updates (running → completed/failed/cancelled)\n- [ ] Tests",
          "status": "in_progress",
          "position": 2
        }
      ]
    },
    {
      "id": "ugQ61H_Jcqrk",
      "title": "Kanban Board",
      "description": "Drag-and-drop kanban board for managing epics across workflow columns (Backlog, To Do, In Progress, Review, Done) with epic detail editing.",
      "priority": 0,
      "status": "done",
      "position": 51,
      "branchName": null,
      "user_stories": [
        {
          "id": "yiUJ6vswqPNO",
          "title": "Display epics in kanban columns",
          "description": "As a developer, I want to see my epics organized in kanban columns by status, so that I can visualize my project workflow.",
          "acceptance_criteria": "- [x] Five columns: Backlog, To Do, In Progress, Review, Done\n- [x] Epic cards show title, priority badge, US count, branch name\n- [x] Cards sorted by position within columns\n- [x] Loading skeleton during data fetch\n- [ ] Tests",
          "status": "in_progress",
          "position": 0
        },
        {
          "id": "Au1CN7-beoHi",
          "title": "Drag and drop epics between columns",
          "description": "As a developer, I want to drag epics between kanban columns to update their status, so that I can manage workflow progression.",
          "acceptance_criteria": "- [x] Drag-and-drop between columns updates status\n- [x] Drag-and-drop within column reorders position\n- [x] DragOverlay provides visual feedback\n- [x] Optimistic UI with rollback on API failure\n- [x] Batch reorder API with transactions\n- [ ] Tests",
          "status": "in_progress",
          "position": 1
        },
        {
          "id": "6h9POeAF7Cki",
          "title": "View and edit epic details",
          "description": "As a developer, I want to click an epic card to view and edit its details including user stories, so that I can manage epic content.",
          "acceptance_criteria": "- [x] Side sheet opens on epic click\n- [x] Inline editing for title and description\n- [x] Priority and status dropdowns\n- [x] User story list with add, update status, delete\n- [x] Branch name display\n- [ ] Tests",
          "status": "in_progress",
          "position": 2
        },
        {
          "id": "MFyKT3Ce7Nf7",
          "title": "Select multiple epics for batch operations",
          "description": "As a developer, I want to select multiple epics with checkboxes, so that I can launch Claude Code builds for them.",
          "acceptance_criteria": "- [x] Checkbox on each epic card\n- [x] Selection state tracked in parent\n- [x] Build toolbar shows selected count\n- [x] 'Build with Claude Code' button enabled when epics selected\n- [ ] Tests",
          "status": "in_progress",
          "position": 3
        }
      ]
    },
    {
      "id": "9D8XWvhZju9s",
      "title": "Named Agents Global Dropdown Cutover (Runtime-Only Selection)",
      "description": "Standardize the product so runtime workflows select only named agents, not raw provider/model pairs. Provider/model selection remains available only when creating or editing named agents. Implementation plan: 1) inventory all provider/model dropdowns and classify runtime vs Named Agent CRUD/admin; 2) enforce a globally seeded default named agent created once (`Claude Code` + `claude-opus-4-6`) with idempotent seed logic; 3) replace all runtime selectors with a shared named-agent dropdown bound to `namedAgentId`; 4) route every build/review/fix/release dispatch through `resolveAgent()` returning `{ provider, model }`; 5) use process-manager dispatch to invoke the correct CLI implementation (including `gemini-cli`) with headless-safe execution patterns; 6) keep upgrades non-breaking by falling back to the global default when legacy/missing `namedAgentId` is encountered instead of requiring DB backfill; 7) add backend, frontend, and e2e regression tests proving no runtime path still depends on raw provider selection.",
      "priority": 0,
      "status": "in_progress",
      "position": 0,
      "branchName": "feature/epic-9D8XWvhZju9s-named-agents-global-dropdown-cutover-run",
      "user_stories": [
        {
          "id": "a7t95IN5LJSO",
          "title": "As a workspace admin, I want a global default named agent seeded once so that runtime flows always have a safe fallback",
          "description": "Create and maintain a single global default named agent used when no explicit named agent is resolvable. The default is provider `claude-code` with model `claude-opus-4-6`.",
          "acceptance_criteria": "- [ ] On bootstrap/migration, the system creates the default named agent if it does not exist.\n- [ ] The seed is idempotent and never creates duplicates.\n- [ ] The default is global (not project-scoped).\n- [ ] Runtime fallback logic can always resolve this default agent.",
          "status": "done",
          "position": 0
        },
        {
          "id": "ibvw75HHsvP6",
          "title": "As a project user, I want every runtime dropdown to select a named agent so that agent selection is consistent across the app",
          "description": "Replace provider/model runtime selectors across build, review, assignment, release, and related operational actions with a named-agent selector.",
          "acceptance_criteria": "- [ ] All user-facing runtime dropdowns use `namedAgentId`.\n- [ ] Raw provider/model options are removed from runtime surfaces.\n- [ ] Empty-state UX directs users to create a named agent and/or uses default fallback behavior.\n- [ ] No runtime UI surface exposes provider/model selection outside Named Agent CRUD.",
          "status": "done",
          "position": 1
        },
        {
          "id": "FtU9bun5x7vv",
          "title": "As a workspace admin, I want provider/model selection limited to named-agent create/edit so that agent definitions are centrally managed",
          "description": "Keep provider and model controls only in the Agents management experience, including support for the Gemini CLI provider and model selection validation.",
          "acceptance_criteria": "- [ ] Agents CRUD supports create, list, update, and delete operations for named agents.\n- [ ] Agent create/edit forms include provider selection and model input/validation.\n- [ ] Provider list includes `claude-code` and `gemini-cli`.\n- [ ] Runtime forms do not include provider/model fields.",
          "status": "done",
          "position": 2
        },
        {
          "id": "IG8AQRoyG98V",
          "title": "As the orchestration backend, I want all dispatch routes to resolve `{ provider, model }` from `namedAgentId` so that the correct CLI is always invoked",
          "description": "Unify dispatch by requiring `resolveAgent()` across build/review/fix/release endpoints and pass resolved provider/model into generalized process-manager dispatch.",
          "acceptance_criteria": "- [ ] All relevant execution routes call `resolveAgent()` before spawning a CLI process.\n- [ ] `resolveAgent()` returns a `{ provider, model }` tuple for valid, missing, and invalid IDs.\n- [ ] Dispatch supports provider-specific runners (including Gemini CLI) from the same orchestration path.\n- [ ] Automated tests validate route-level resolution and provider-specific command construction.",
          "status": "done",
          "position": 3
        },
        {
          "id": "vL5Lfvo8Gs7U",
          "title": "As an existing customer, I want legacy provider/model assignments to keep working so that upgrades do not break active workflows",
          "description": "Support legacy records that do not yet have `namedAgentId` by applying runtime fallback to the global default agent, while ensuring new writes use named-agent references.",
          "acceptance_criteria": "- [ ] If `namedAgentId` is null, missing, or invalid, runtime execution falls back to the global default named agent.\n- [ ] Existing records are not blocked and do not require a one-time backfill migration.\n- [ ] New or updated assignments persist `namedAgentId` as the runtime selector.\n- [ ] Regression tests cover legacy-read + fallback + new-write behavior.",
          "status": "done",
          "position": 4
        },
        {
          "id": "H2o-yqJEGkmK",
          "title": "As a QA engineer, I want regression coverage for the dropdown cutover so that provider-based runtime selection cannot reappear",
          "description": "Add automated coverage to guarantee runtime surfaces and dispatch paths remain named-agent-first and fallback-safe over time.",
          "acceptance_criteria": "- [ ] Frontend tests assert runtime forms render named-agent selectors and not provider selectors.\n- [ ] Backend tests assert fallback resolution and provider/model tuple output from `resolveAgent()`.\n- [ ] End-to-end tests validate build/review/release execution with explicit named agents and fallback scenarios.\n- [ ] Test failures clearly identify any route or UI surface still using provider-based runtime selection.",
          "status": "done",
          "position": 5
        }
      ]
    },
    {
      "id": "HGhTDE1Y__j_",
      "title": "THe chat bar is too small in chat",
      "description": null,
      "priority": 2,
      "status": "in_progress",
      "position": 1,
      "branchName": "feature/epic-HGhTDE1Y__j_-the-chat-bar-is-too-small-in-chat",
      "user_stories": []
    }
  ]
}
